{"Addison village, Illinois": "Addison is a village located west of the Chicago Metropolitan Area, in DuPage County, Illinois, United States. The population was 36,942 at the 2010 census.<br /><br />The Village of Addison lies on Salt Creek. The community itself was originally named Dunkley's Grove after the settler Hezekiah Dunklee, and was renamed after a town in England or Addison, New York.<br /><br />The Addison Industrial District was the proposed location for the reconstruction of Comiskey Park in the late 1980s before this was voted down.<br /><br />Adventureland amusement park was located in Addison (Lake and Medinah) during the 1960s and 1970s.<br /><br />Rich Veenstra is the Mayor of Addison. Other elected officials include Village Trustees Sylvia Layne, Harry Theodore, Tom Hundley, Bill Lynch, Cathy Kluczny and Joe McDermott, and Village Clerk Lucille Zucchero.<br /><br />The town of Triggiano, Italy is the sister city of Addison", "Algonquin village, Illinois": "Algonquin is a village in Illinois located in both McHenry and Kane counties. It is a northwest suburb of Chicago, located approximately 40 miles from the Loop. The 2010 Census placed the Village's population at 30,046, growing considerably from the 2000 Census figure of 23,276.<br /><br />The village is known as \"The Gem of the Fox River Valley\", since its downtown is nestled in the heart of Illinois' Fox River Valley. Established in 1890 and long known as a small river community, the village is making the transition into a major regional hub, as it has experienced considerable suburban growth over the past 20 years. Now stretching all the way west to the busy Randall Road corridor, Algonquin has become a major commercial center, with popular shopping centers and restaurants, as well as a growing corporate campus. Additionally, the village continues to see considerable residential growth. With this growth, the village has had to deal with challenges including traffic congestion and overburdened schools, yet has managed to increase the commercial tax base, preserve its character and history, and substantially increase its recreational offerings and quality of life.", "Alsip village, Illinois": "Alsip is a village in Cook County, Illinois, United States. The population was 19,277 at the 2010 census. It is a suburb of Chicago.<br /><br />Alsip was settled in the 1830s by German and Dutch farmers. The village is named after Frank Alsip, the owner of a brickyard that opened there in 1885. The village began to grow after the Tri-State Tollway was built there in 1959.", "Antioch village, Illinois": "Antioch is a village in the Antioch Township of Lake County, Illinois, United States. The population was 14,430 at the 2010 census.", "Arlington Heights village, Illinois": "Arlington Heights is a town in Cook County in the U.S. state of Illinois. A suburb of Chicago, it lies about 25 miles (40 km) northwest of the city's downtown. The population was 75,101 at the 2010 census. It is the most populous community in the United States that is incorporated as a \"village\", although it is not far ahead of its nearby Illinois neighboring villages of Schaumburg and Bolingbrook and adjacent Palatine.<br /><br />Arlington Heights is known for Arlington Park Race Track, home of the Arlington Million, a Breeders' Cup qualifying event; it also hosted the Breeders' Cup Classic in 2002. The village is also home to the Arlington Heights Memorial Library, which has one of the largest collections in the state.", "Aurora city, Illinois": "Aurora, a suburb of Chicago, is a city predominantly in Kane County and DuPage County, with portions extending into Kendall and Will counties. It is located in the outer region of Greater Chicago in the U.S. state of Illinois. It is the second most populous city in the state, and the 114th most populous city in the country. The population was 197,899 at the 2010 census, and was estimated to have increased to 199,963 by July 2013.<br /><br />Once a mid-sized manufacturing city, Aurora has grown tremendously since the 1960s. Founded within Kane County, Aurora's city limits and population have since expanded into DuPage, Will, and Kendall counties. Between 2000 and 2003, the U.S. Census Bureau ranked Aurora as the 34th fastest growing city in the United States. From 2000 to 2009, the U.S. Census Bureau ranked the city as the 46th fastest growing city with a population of over 100,000.<br /><br />In 1908, Aurora officially adopted the nickname \"City of Lights,\" because it was one of the first cities in the United States to implement an all-electric street lighting system in 1881. Aurora's historic downtown is located on the Fox River, and centered on Stolp Island. The city is divided into three regions, The West Side, located on the west side of the Fox River, The East Side, located between the eastern bank of the Fox River and the Kane/DuPage County line, and the Far East Side/Fox Valley, which is from the County Line to the city's eastern border with Naperville.<br /><br />The Aurora area is home to an impressive collection of architecture, including structures by Frank Lloyd Wright, Ludwig Mies van der Rohe, Bruce Goff and George Grant Elmslie. The Hollywood Casino Aurora, a dockside gaming facility with 53,000 square feet (4,900 m2) and 1,200 gaming positions, is located on the river in downtown Aurora. Aurora is also home to a large collection of Sears Catalog Homes (over 50 homes) and Lustron all-steel homes (seven homes).", "Bannockburn village, Illinois": "Bannockburn is a village in West Deerfield and Vernon townships of Lake County, Illinois, United States. The population was 1,583 at the 2010 census. Part of the Chicago area's North Shore region, Bannockburn has very high real-estate values; the average value for a home in Bannockburn in 2005 was $1,279,700. The Friedman house by Frank Lloyd Wright is located in Bannockburn.<br /><br />Bannockburn was founded by Scottish real estate developer William Aitken, who planned a community of \"country estates\" on 110 acres (0.45 km2) in inland Lake County. Named for the Scottish village of Bannockburn, the village began construction in 1924 and was incorporated in 1929. Aitken designed his development for the affluent members of his bridge and country club. His plan for Bannockburn featured large lots to imitate country living, and this design has been preserved; in fact, the original 1-acre (4,000 m2) minimum on home lots has been increased to two.<br /><br />Gradually, Bannockburn expanded its boundaries to its current 1,318 acres (5.33 km2). The Tri-State Tollway was built through the village in the 1950s, encouraging growth, though traffic noise pollution has been a persistent local concern. In the late 1960s Bannockburn's citizens, after some debate, approved the construction of the first of several business parks along the village's northern edge. It created its first commercial zone in 1984 along Illinois Route 22. Bannockburn's municipal services expanded slowly in an effort to limit taxes, but it established a police department in the 1970s and built a village hall in 1992.", "Barrington Hills village, Illinois": "Barrington Hills is a village located about 40 miles (64 km) northwest of Chicago in the U.S. state of Illinois. It straddles approximately 29 square miles (75 km2) over four counties, Cook, Kane, Lake, and McHenry. The population was 4,209 at the 2010 census. The Village of Barrington Hills was incorporated in 1957.<br /><br />The suburban village is included in the greater Barrington area. Some affluent residents live on large estates and commute to downtown Chicago. A minimum 5-acre (2.0 ha) zoning restriction has been in effect on new construction since 1963, but the existence of equestrian farms antedates the village by decades. Farming and horse raising are allowed.<br /><br />Barrington Hills includes farms and estates such as Hill 'N Dale Farms, owned by Richard L. Duchossois, former owner of the Arlington Park racetrack, and the Bank Note Farm. The identification of the area with horses carries over to the names Broncos and Colts for school teams.", "Barrington village, Illinois": "Barrington is an affluent suburban village in Cook and Lake counties, Illinois, United States. The population was 10,327 at the 2010 census. Located approximately 32 miles (51 km) northwest of Chicago, the area features wetlands, forest preserves, parks, and horse trails in a country-suburban setting.<br /><br />The Barrington area ZIP code, 60010, is the seventh-wealthiest ZIP code in the United States among areas with a population of 20,000 or more.<br /><br />Barrington is part of the Chicago metropolitan area and serves as the hub of activity for the surrounding 90-square-mile (230 km2) region which consists of six independent villages including North Barrington, South Barrington, Barrington Hills, Lake Barrington and Tower Lakes, as well as small portions of Carpentersville, Deer Park, Hoffman Estates, and Inverness. The village's motto is \"a great place to live, work, and play!\"", "Bartlett village, Illinois": "Bartlett is a village located in Cook and DuPage counties, Illinois. A small parcel on the western border is in Kane County. The population was 41,208 at the 2010 census.", "Batavia city, Illinois": "Batavia (/bəˈteɪviə/) is a city in DuPage and Kane counties in the U.S. state of Illinois. A suburb of Chicago, it was founded in 1833 and is the oldest city in Kane County. During the latter part of the 19th century, Batavia, home to six American-style windmill manufacturing companies, became known as \"The Windmill City.\" Fermi National Accelerator Laboratory, a federal government-sponsored high-energy physics laboratory, where both the bottom quark and the top quark were first detected, is located in the city.<br /><br />Batavia is part of a vernacular region known as the Tri-City area, along with St. Charles and Geneva, all western suburbs of similar size and relative socioeconomic condition.<br /><br />As of the 2010 census, the city had a total population of 26,045, which was estimated to have increased to 26,318 by July 2012.", "Beach Park village, Illinois": "Beach Park is a village in the Benton and Waukegan townships of Lake County, Illinois, United States. The population was 13,638 at the 2010 census.<br /><br /><br /><br />", "Bedford Park village, Illinois": "Bedford Park is a village in Cook County, Illinois, United States. The population was 580 at the 2010 census. Bedford Park consists of a small residential area and vast amounts of heavy industry sprawling to the east and a small amount to the west.", "Beecher village, Illinois": "Beecher is a village in Will County, Illinois, United States. It is located on the old Chicago and Eastern Illinois Railroad and the Dixie Highway. Situated in the center of Washington Township, it was originally named Washington Center. Named for Henry Ward Beecher, Beecher was founded in 1870 and incorporated as a village in 1884. Originally governed by a village president and board of trustees, a village administrator was hired to handle daily tasks in 1988. The city clerk is an appointed position.<br /><br />The population was 4,359 at the 2010 census.", "Bellwood village, Illinois": "Bellwood is a village in Proviso Township, Cook County, Illinois, United States. Located 13 miles (21 km) west of Chicago's downtown Loop, the village of Bellwood is bounded by the Eisenhower Expressway (south), the Proviso yards of the Union Pacific Railroad (north), and the suburbs of Maywood (east) and Hillside and Berkeley (west). The population was 19,071 at the 2010 census.", "Bensenville village, Illinois": "Bensenville is a village located in DuPage County, Illinois, with a portion of the town near O'Hare International Airport in Cook County, officially belonging to the City of Chicago. As of the 2010 census, the village population was 18,352.<br /><br />First known as Tioga, it was formally established as Bensenville in 1873 along the Milwaukee Road railway. The community is named after Benzen, Germany. A post office was established in 1873, but because there was an existing \"Benson\", the suffix \"ville\" was added.<br /><br />The Edge Ice Arena is located in Bensenville, former home of the Chicago Steel junior ice hockey team.<br /><br />The Churchville School in Bensenville is listed on the National Register of Historic Places.", "Berkeley village, Illinois": "Berkeley is a village located in Cook County, Illinois, United States. Incorporated in 1924, the population at the 2010 census was 5,209.<br /><br />The town has a commuter railroad station on Metra's Union Pacific/West Line with service to downtown Chicago.<br /><br />Berkeley is on Cook County's western border, 14 miles west of the Chicago Loop. With Interstates 290 and 294 forming its western and part of its southern boundary, and the Union Pacific Railroad (formerly the Chicago & North Western) and the large Proviso Railyard (a classification yard) to the north, Berkeley has ready access to the metropolitan region. Yet the transportation corridors that make Berkeley accessible to distant places also serve to separate the village from its nearest neighbors, creating a small-town atmosphere.", "Berwyn city, Illinois": "Berwyn /ˈbɜːrwᵻn/ is a suburban city in Cook County, Illinois, coterminous with Berwyn Township, which was formed in 1908 after breaking off from Cicero Township. As of the 2010 census, the city had a total population of 56,657.", "Big Rock village, Illinois": "Big Rock is a village in Kane County, Illinois, United States. It is located approximately 50 miles due west of Chicago. It is between the villages of Hinckley and Sugar Grove.<br /><br />As of the 2000 census, the village had a total population of 658, although it only became incorporated in July 26, 2001.", "Bloomingdale village, Illinois": "Bloomingdale is a village in DuPage County, Illinois, United States, approximately 25 miles west of Chicago. The population was 22,018 at the 2010 census.", "Blue Island city, Illinois": "Blue Island is a city in Cook County, Illinois, located approximately 16 miles (26 km) south of Chicago's Loop. Blue Island is adjacent to the city of Chicago and shares its northern boundary with that city's Morgan Park neighborhood. The population was 23,706 at the 2010 United States Census.<br /><br />Blue Island was established in the 1830s as a way station for settlers traveling on the Vincennes Trace, and the settlement prospered because it was conveniently situated a day's journey outside of Chicago. The late-nineteenth-century historian and publisher Alfred T. Andreas made the following observation regarding the appearance of the young community in History of Cook County Illinois (1884), \"The location of Blue Island Village is a beautiful one. Nowhere about Chicago is there to be found a more pleasant and desirable resident locality.\"<br /><br />Since its founding, the city has been an important commercial center in the south Cook County region, although its position in that respect has been eclipsed in recent years as other significant population centers developed around it and the region's commercial resources became spread over a wider area. In addition to its broad long-standing industrial base, the city enjoyed notable growth in the 1840s during the construction of the feeder canal (now the Calumet Sag Channel) for the Illinois and Michigan Canal and as the center of a large brick-making industry beginning in the 1850s, which eventually gave Blue Island the status of brick-making capitol of the world. Beginning in 1883, Blue Island was also host to the car shops of the Rock Island Railroad. Blue Island was home to several breweries, who used the east side of the hill to store their product before the advent of refrigeration, until the Eighteenth Amendment made these breweries illegal in 1919. A large regional hospital and two major clinics are also located in the city.<br /><br />Although initially settled by \"Yankee\" stock, Blue Island has been the point of entry for many of America's immigrants, beginning in the 1840s with the arrival of a large German population that remained a prominent part of the city's ethnic makeup for many years. By 1850, half of Blue Island's population was either foreign-born or the children of foreign-born residents. Later, significant groups came from Italy, Poland, Sweden and Mexico.<br /><br />The city is one of ten incorporated areas in Illinois to have been designated by the White House as a \"Preserve America\" community.", "Bolingbrook village, Illinois": "The village of Bolingbrook is a southwest suburb of Chicago that is partially in both Will and DuPage counties in the U.S. state of Illinois. As of the 2010 US Census, the population is 73,366. It is the 17th largest incorporated place in Illinois and the state's 2nd largest village.", "Braceville village, Illinois": "Braceville is a village in Will County, Illinois, United States, with a portion in Grundy County. The population was 793 at the 2010 census.<br /><br /><br /><br />", "Braidwood city, Illinois": "Braidwood is a city in Will County, Illinois, United States, approximately 53 miles (85 km) southwest of Chicago and 18 miles (29 km) south of Joliet. The population was 5,203 at the 2000 census.<br /><br />The Braidwood Nuclear Generating Station, a nuclear power plant currently owned by Exelon Corporation, is also located in the area (although the plant's address is actually in the nearby town of Braceville). The station is one of the major employers in the area and provides a significant portion of the electricity used in the Chicago area.<br /><br />Braidwood was featured in the film Planes, Trains, and Automobiles, starring Steve Martin and John Candy. The scene in the movie at the Braidwood Inn (now the Sun Motel) was not filmed in Wichita, but was filmed in Braidwood, Illinois. Other neighboring towns such as Coal City also briefly appeared in the movie.<br /><br />Reed-Custer Community Unit School District 255 educates students from in and around Braidwood, Custer Park, Essex, and Godley. The district has 4 schools: Reed-Custer Primary School (Grades PreK-1), Reed-Custer Intermediate School (Grades 2-5), Reed-Custer Middle School (Grades 6-8), and Reed-Custer High School (Grades 9-12). The district level administrators are: Mark Mitchell (Superintendent), Christine Nelson (Assistant Superintendent), and Jim King (Director of Operations).<br /><br />Reed-Custer High School is located in Braidwood. Reed-Custer High School is located at 249 Comet Drive in Braidwood, IL 60408. The principal at RCHS is Tim Ricketts. RCHS is part of the Reed-Custer School District known as 255U. The school mascot is known as \"Comets\". RCHS offers numerous classes that vary on many different subjects that are not just core classes.", "Bridgeview village, Illinois": "Bridgeview is a village in Cook County, Illinois, United States. It is located approximately 13 miles (21 km) southwest of the Chicago Loop. As of the 2010 census, the village population was 16,446. Bridgeview is home to the Chicago Fire of Major League Soccer.", "Broadview village, Illinois": "Broadview is a village in Cook County, Illinois, 12 miles (19 km) west of downtown Chicago. As of the 2010 census it had a population of 7,932.", "Brookfield village, Illinois": "Brookfield (formerly Grossdale) is a village in Cook County, Illinois, United States, 13 miles (21 km) west of downtown Chicago. The population was 18,978 at the 2010 census. It is home to the Brookfield Zoo.", "Buffalo Grove village, Illinois": "Buffalo Grove is a village in Cook and Lake counties in the U.S. state of Illinois, within the northern suburbs of Chicago.<br /><br />As of the 2010 census, the village population was 41,496. Most of the village is located within the 10th Congressional District of Illinois, although the southern portion is represented in the 8th Congressional District.", "Bull Valley village, Illinois": "Bull Valley is an affluent village in McHenry County, Illinois, United States. The population was 726 at the 2000 census. However, at the 2010 census, the population was at 1,077. Surrounded by the urban sprawl of Crystal Lake, Woodstock, and McHenry, the village prides itself in its rural, low-density character.", "Burbank city, Illinois": "Burbank is a city in Cook County, Illinois, United States. The population was 28,925 at the 2010 census. It is located at the southwest edge of the city of Chicago; the Chicago city limit – specifically that of the Ashburn neighborhood – is in common with Burbank's eastern city limit. Burbank shares a boundary with Oak Lawn to its south, Bridgeview to its west, and Bedford Park to its north; the city of Hometown is also adjacent to Burbank's southeast corner. Burbank is less than two miles south of Chicago Midway International Airport. The current mayor is Harry J. Klein, who took office in 1991.", "Burlington village, Illinois": "Burlington is a village in Kane County, Illinois, United States. The population was 618 at the 2010 census, up from 452 in 2000.", "Burnham village, Illinois": "Burnham is a village in Cook County, Illinois, United States. The population was 4,206 at the 2010 census. The ZIP code is 60633.<br /><br />Burnham has a Chicago ZIP code, and is often mistakenly considered part of Chicago. It is, however, an independent municipality lying just south of the Chicago city limits.<br /><br />Burnham was named for Telford Burnham who drew its plat; not, as is widely assumed, by Chicago city planner and architect Daniel Burnham.<br /><br />There are two sections of Burnham. The westernmost section surrounds Torrence Avenue, a north-south street. Torrence Avenue leaves this part of Burnham via a bridge, with Chicago on the other side. The eastern section surrounds Burnham Avenue, another north-south street. This section of Burnham ends at Brainard Avenue, where the Hegewisch neighborhood of Chicago lies on the other side. Upon entering Chicago, Burnham Avenue becomes Avenue O.<br /><br />Burnham is bordered by Chicago to the north, Calumet City to the south and west, and Hammond, Indiana, to the east.", "Burr Ridge village, Illinois": "Burr Ridge (formerly Harvester) is a suburb of Chicago, in Cook and DuPage counties, Illinois, United States. The village is listed among the top wealthiest towns in Illinois and is locally known for its large beautiful residences. The population was 10,559 at the 2010 census.", "Calumet City city, Illinois": "Calumet City (/kæl.juːˈmɛt/ kal-yew-MET) is a city in Cook County, Illinois, United States. The population was 37,042 at the 2010 census, a decline of 5.2% from 2000. The ZIP code is 60409.<br /><br />Calumet City (commonly referred to locally as \"Cal City\") was founded in 1893 when the villages of Schrumville and Sobieski Park merged under the name of West Hammond, since it lies on the west side of the Illinois-Indiana line from Hammond, Indiana. In 1924, West Hammond officially became Calumet City after its citizens voted to change the name in 1923.<br /><br />In addition to being bordered to the east by Hammond, it is also bordered by Burnham and Chicago to the north, Lansing to the south, and South Holland and Dolton to the west.", "Calumet Park village, Illinois": "Calumet Park (formerly DeYoung) is a village in Cook County, Illinois. The population was 7,835 at the 2010 census.<br /><br />On May 13, 2010, Mayor Joseph DuPar and the Village Board approved renaming 127th Street as Obama Drive, in honor of the 44th President of the United States. On August 21, 2010, State Senator Emil Jones III read a proclamation of the Illinois Senate in honor of the dedication on the same date. This road became the first Obama Drive in the country and the first road named after President Obama in his home state of Illinois.", "Campton Hills village, Illinois": "Campton Hills is a village in Kane County, Illinois and is a far western suburb of Chicago. The population of the village is 11,131 per the 2010 US Census.<br /><br />The village was established on May 14, 2007 by incorporating 20.3 square miles of Campton and Plato townships. The incorporation followed an April 17 referendum in which 55 percent of voters approved incorporation. Several areas on the village's boundaries disconnected within the first year of incorporation, taking advantage of less restrictive requirements imposed by state statute during that period. As of August 2009, the village comprises 17.16 square miles (44.4 km2).<br /><br />The village is served by three school districts. The majority is served by St. Charles Community Unit School District 303 while the northern end is served by Central Community Unit School District 301. Kaneland Community Unit School District 302 serves the far southwest portion of the village.<br /><br />The first President and one of the founders of the village was Patsy Smith. Due to confusion over the requirements of Illinois election laws, an opposition group filed nominating petitions for a primary election to be held in February 2015; in previous municipal elections it had been believed that a primary was not required for the non-partisan general election. Over the objections of Smith and her supporters, a Kane County judge affirmed the requirement for a primary. Forced to run as a write-in candidate in the general election, Smith lost in her bid for re-election to Harry Blecker, an incumbent Village Trustee who had appeared on the primary ballot as a candidate for Village President.", "Carol Stream village, Illinois": "Carol Stream is a village in DuPage County, Illinois, United States. Incorporated on January 5, 1959, and named after the developer's daughter, Carol Stream had a population of 39,711 as of the 2010 U.S. census. In 2011 CNN's Money Magazine ranked Carol Stream 49th on its list of 100 best places to live in the United States.", "Carpentersville village, Illinois": "Carpentersville is a village in Kane County, Illinois, United States. The population was 37,691 at the 2010 census.", "Cary village, Illinois": "Cary is a village located in Algonquin Township, McHenry County, Illinois, United States. The population was 17,965 as of 2017.", "Channahon village, Illinois": "Channahon is a village in Grundy and Will counties in the U.S. state of Illinois. The population was 12,560 at the 2010 census. Channahon is also the name of the township in which most of the village resides. The current village president is Missey Moorman Schumacher.", "Chicago Heights city, Illinois": "Chicago Heights is a city in Cook County, Illinois, United States. The population was 30,276 at the 2010 census.In earlier years, Chicago Heights was nicknamed \"The Crossroads of the Nation\". Currently, it is nicknamed \"The Heights\".", "Chicago Ridge village, Illinois": "Chicago Ridge is a village in Cook County, Illinois, United States. The population was 14,305 at the 2010 census.", "Chicago city, Illinois": "From a city and state: This is a redirect from a geographic location that uses the format \"city, state\" to a more general related article. These redirects are used to conform with the Wikipedia guideline on naming geographic locations.", "Cicero town, Illinois": "Cicero, a suburb of Chicago, is an incorporated town in Cook County, Illinois, United States. The population was 83,891 at the 2010 census. As of 2013, the town had a total population of 84,103, making it the tenth-largest municipality in Illinois. Cicero is named for the town of Cicero, New York, which in turn was named for Marcus Tullius Cicero, the Roman statesman and orator.", "Clarendon Hills village, Illinois": "Clarendon Hills is a village in DuPage County, Illinois, United States. The population was 7,610 at the 2000 census.", "Coal City village, Illinois": "Coal City is a village in Grundy and Will Counties in the U.S. state of Illinois. It is considered a fringe town within the greater Chicago Metropolitan area. The population was 5,587 at the 2010 census. It is served by Interstate 55. The Santa Fe Railway formerly served Coal City at Coal City Station.", "Country Club Hills city, Illinois": "Country Club Hills is a city in Cook County, Illinois, United States. The population was 16,541 at the 2010 census.", "Countryside city, Illinois": "Countryside is a city in Cook County, Illinois, United States. The population was 5,895 at the 2010 census.", "Crest Hill city, Illinois": "Crest Hill is a city in Lockport Township, Will County, Illinois, United States. The 2010 census put Crest Hill's population at 20,837.<br /><br /><br /><br />", "Crestwood village, Illinois": "Crestwood is a village in Cook County, Illinois, United States. The population was 10,950 at the 2010 census. Crestwood has been cited as a success story by proponents of low taxes and minimal government, but in April 2009, the Chicago Tribune revealed that Crestwood's low taxes were due to illegally saving money on its water bills by secretly supplementing its drinking water from a well that was contaminated with toxic chemicals. \"Officials in the south suburb had pumped tainted water to residents for more than two decades to avoid the cost of fixing leaky water mains.\"", "Crete village, Illinois": "Crete is a village in Will County, Illinois, United States. The population was 7,346 at the 2000 census. Originally named Wood's Corner, it was founded in 1836 by Vermonters Dyantha and Willard Wood.", "Crystal Lake city, Illinois": "Crystal Lake is a city located in southeastern McHenry County in the northeastern part of the U.S. state of Illinois. It is named after a lake located 1.6 miles (2.6 km) west-southwest of the city's downtown. Crystal Lake is about 45 miles northwest of Chicago. The population was 38,000 at the 2000 census, and 40,743 in 2010. Crystal Lake is the largest city in McHenry County, part of the Chicago metropolitan area. The name \"Crystal Lake\" is often shortened to \"CL\" locally when referring to the town.", "Darien city, Illinois": "Darien is a city in DuPage County, Illinois, USA. The population was 22,086 at the 2010 census.<br /><br />A suburb of Chicago, Darien was named after a town in Connecticut.", "Deer Park village, Illinois": "Deer Park is a village in Lake County, Illinois. The population was 3,200 at the 2010 census. The village is one of the few left in the Chicago area that enjoy a green belt which is bordered by two large natural areas providing outdoor recreation and open space. The village is home to popular shopping and dining destinations: Deer Park Town Center and the Town Center Promenade. The town is also home to the Vehe Farm, an Illinois Centennial Farm.<br /><br />Residential zoning is mainly single family homes with lot of sizes of 1-acre (4,000 m2) or more. Upscale townhomes are available near the Deer Park Center. The Metra/Chicago & Northwestern train line provides commuter service to Chicago with stations in nearby Barrington and Palatine.", "Deerfield village, Illinois": "Deerfield is a village in Lake County, Illinois, United States, approximately 25 miles north of Chicago. The population was 18,225 at the 2010 census, a decline of 175 from 2000.<br /><br />Deerfield is home to the headquarters of Walgreens, Baxter Healthcare, Business Technology Partners, APAC Customer Services, Fortune Brands, Takeda Pharmaceuticals, Consumers Digest, and Mondelēz International. Deerfield High School is one of the top high schools in the state, ranking #5 in 2012.<br /><br />Deerfield is represented by the 10th Congressional District of Illinois (Democrat Brad Schneider), 29th District of the Illinois Senate (Democrat Julie Morrison) and the 58th District of the Illinois House of Representatives (Democrat Scott Drury).", "Des Plaines city, Illinois": "Des Plaines /dᵻsˈpleɪnz/ is a city in Cook County, Illinois, United States. As of the 2010 census, the city had a population of 58,364. It is a suburb of Chicago and is just north of O'Hare International Airport. It is located on, and named for, the Des Plaines River, which runs through the city just east of its downtown area. Des Plaines is the home of the first franchised McDonald's opened by Ray Kroc in 1955, which is preserved as a museum on Lee Street, north of downtown.", "Diamond village, Illinois": "Diamond is a village in Grundy and Will Counties, Illinois. The population was 2,527 at the 2010 census. Terry Kernc is the current mayor of Diamond.", "Dixmoor village, Illinois": "Dixmoor (formerly Specialville) is a village in Cook County, Illinois, United States. The population was 3,644 at the 2010 census.<br /><br />Dixmoor is adjacent to Harvey and keeps Harvey's east-west numbering system, even though most of the village lies west of Ashland Avenue/Wood Street.", "Dolton village, Illinois": "Dolton (pronounced \"DAWL-ton\") is a village in Cook County, Illinois, United States. The population was 23,153 at the 2010 census. Dolton is located just west of the expressway Interstate 94 and immediately south of the city limits of Chicago. Its most common ZIP code is 60419.<br /><br />Dolton is bordered by Chicago to the north, Riverdale and Harvey to the west, South Holland to the south and Calumet City to the east.", "Downers Grove village, Illinois": "Downers Grove is a village in DuPage County, Illinois, United States. It was founded in 1832 by Pierce Downer, whose surname serves as the eponym for the village. Approximately 20 miles from the Loop, Downers Grove is a far south-western suburb of Chicago. The most recent census estimate tallied 49,715 residents in 2014.", "East Dundee village, Illinois": "East Dundee is a village in Kane County with a small section in Cook County. The population was 2,860 at the 2010 census.", "East Hazel Crest village, Illinois": "East Hazel Crest is a village in Cook County, Illinois, in the United States. It is a suburb of Chicago. As of the 2010 census, the village population was 1,543.<br /><br /><br /><br />", "Elburn village, Illinois": "Elburn is a village in Kane County, Illinois, United States. The population was 5,602 as of the 2010 census, up from 2,756 at the 2000 census. It is located at the intersection of Illinois Route 38 and Route 47. Elburn is a far-west suburb situated 46 miles (74 km) due west of the Chicago Loop with frequent commuter rail service from its Metra station at the end of the Union Pacific West Line.<br /><br /><br /><br />", "Elgin city, Illinois": "Elgin (/ˈɛldʒᵻn/ ELL-jin) is a city in Cook and Kane counties in the northern part of the U.S. state of Illinois. Located roughly 35 mi (56 km) northwest of Chicago, it lies along the Fox River. As of 2013, the city had a total population of 110,145, making it the eighth-largest city in Illinois.", "Elk Grove Village village, Illinois": "Elk Grove Village is a village located in northeastern Illinois adjacent to O'Hare International Airport and the city of Chicago. The village is located primarily in Cook County with a small portion in DuPage County. The population was 33,127 at the 2010 census. As the name suggests, Elk Grove Village is home to a small herd of elk kept in a grove at the eastern edge of the Busse Woods forest preserve for which the grove is named. Elk are not native to the area but were brought from Montana by an early resident, Busse, in the 1920s. The elk are currently maintained by the Chicago Zoological Society veterinary staff and the Busse Woods Forest Preserve wildlife biologists.", "Elmhurst city, Illinois": "Elmhurst is a city mostly in DuPage County and overlapping into Cook County in the U.S. state of Illinois, and a western suburb of Chicago. As of the 2010 census, the city had a total population of 44,121, which was estimated to have increased to 45,171 by July 2012.", "Elmwood Park village, Illinois": "Elmwood Park is a village in Cook County, Illinois, United States. The population was 24,883 at the 2010 census. The community has long maintained a large Italian-American population, with a more recent influx of Polish-American and Hispanic residents.", "Elwood village, Illinois": "Elwood is a village in Will County, Illinois, United States. The population was 2,279 at the 2010 United States Census.", "Evanston city, Illinois": "Evanston /ˈɛvənˌstən/ is a city in Cook County, Illinois, United States, 12 miles (19 km) north of downtown Chicago, bordered by Chicago to the south, Skokie to the west, and Wilmette to the north, with a population of 74,486 as of 2010. It is one of the North Shore communities that adjoin Lake Michigan and is the home of Northwestern University. The boundaries of the city of Evanston are coterminous with those of the former Evanston Township, which was dissolved in 2014 by voters with its functions being absorbed by the city of Evanston.", "Evergreen Park village, Illinois": "Evergreen Park is a village in Cook County, Illinois, United States. In 2010, the population of Evergreen Park was 19,852, according to that year's census.", "Flossmoor village, Illinois": "Flossmoor (/ˈflɑːsmɔːr/) is a village in Cook County, Illinois, United States. The population was 9,464 at the 2010 census.<br /><br />The village is renowned for the quality and architectural variety of its housing stock, as well as its proximity to numerous country clubs. It is the second safest suburb in the Southland of Cook County, ranking just below the neighboring village of Olympia Fields.", "Ford Heights village, Illinois": "Ford Heights (formerly East Chicago Heights) is a village in Cook County, Illinois, United States. The population was 2,763 at the 2010 census, down from 3,456 in 2000. It is located approximately 25 miles (40 km) south of downtown Chicago and is part of the Chicago–Naperville–Joliet, IL-IN-WI Metropolitan Statistical Area.", "Forest Park village, Illinois": "Forest Park (formerly Harlem) is a village in Cook County, Illinois, a suburb of Chicago, United States. The population was 14,167 at the 2010 census. The Forest Park terminal on the CTA Blue Line is the line's western terminus, located on the Eisenhower Expressway at Des Plaines Avenue.", "Forest View village, Illinois": "Forest View is a village in Cook County, Illinois, United States. The population was 698 at the 2010 census. It is close to Chicago and has a large Slavic population. The village, however, is primarily industrial.", "Fox Lake village, Illinois": "Fox Lake is a village in Grant and Antioch townships in Lake County, Illinois and Burton Township, McHenry County, Illinois, United States. The population was 10,579 at the 2010 census.", "Fox River Grove village, Illinois": "Fox River Grove is a village in the Cuba Township of Lake County and the Algonquin Township of McHenry County, Illinois, United States. The population was 4,854 at the 2010 census.", "Frankfort village, Illinois": "Frankfort is a village in Will County, Illinois, United States. The population was 17,782 at the 2010 census, up from 10,391 in 2000. According to Forbes.com, in 2007 the village ranked as the 36th fastest growing suburb in the United States.", "Franklin Park village, Illinois": "Franklin Park is a village in Cook County, Illinois, United States. The population was 18,333 at the 2010 census.", "Geneva city, Illinois": "Geneva is a city in and the county seat of Kane County, Illinois, United States. It is located on the western side of the Chicago suburbs.<br /><br />Geneva is part of a tri-city area, located between St. Charles and Batavia. As of a July 2011 official US Census Bureau estimate, the city had a total population of 21,707. The area is currently experiencing a high level of population growth as Chicago's urban sprawl spreads farther west.<br /><br />Geneva is a popular tourist destination with its scenic location along the Fox River and numerous shops and restaurants. There is an extensive bike trail system in Geneva including portions of the Fox River Trail and the Illinois Prairie Path. Geneva has an active historical society, the Geneva History Center, located in downtown Geneva as well as the Fabyan Windmill, an old Dutch windmill dating back to the 1850s. In 2013 it was nominated by Bloomberg Business Week as the best place to raise a kid in Illinois.", "Gilberts village, Illinois": "Gilberts is a village in Kane County, Illinois, United States. The population was 1,279 at the 2000 census. The population has grown to 6,879 according to the 2010 census. The population continues to grow at rapid rates.", "Glen Ellyn village, Illinois": "Glen Ellyn is an affluent, suburban village in DuPage County, Illinois, United States. As of the 2010 Census, the village population was 27,450.", "Glencoe village, Illinois": "Glencoe (/ˈɡlɛnˌkoʊ/) is a village in Cook County, Illinois, United States. As of the census, the total population was 8,723. Glencoe is located on suburban Chicago's North Shore and is located within the New Trier High School District.", "Glendale Heights village, Illinois": "Glendale Heights is a village in DuPage County, Illinois, United States. The population was 34,208 at the 2010 census. It is best known nationally as the hometown of Smashing Pumpkins founder Billy Corgan, but known more locally for its ethnically diverse population. The town elected Dupage County's first Asian mayor in 1995.", "Glenview village, Illinois": "Glenview is an affluent suburban village located in Cook County, Illinois on The North Shore (Chicago). As of the 2010 United States Census, the village population was 44,692.<br /><br />The magazine Business Insider has recognized Glenview's schools for their exceptional public education. In 2014, Business Insider ranked Glenview's Glenbrook South High School as the 19th best public high school in the United States.[4] In 2015, Glenbrook School District 225 was also ranked 2nd in the state only behind its neighbor New Trier Township, and 10th in the nation by Business Insider.[5] Glenview's Glenbrook South High School is a part of District 225.", "Glenwood village, Illinois": "Glenwood is a village in Cook County, Illinois, United States. The population was 8,969 at the 2010 census.", "Godley village, Illinois": "Godley is a village in Grundy and Will counties, Illinois, United States. The population was 601 at the 2010 census.", "Golf village, Illinois": "Golf is a village in Cook County, Illinois, United States, incorporated in 1928. As of the 2010 census, the village had a population of 500. The community is primarily residential, and has a dedicated police department, post office, and Metra train stop.", "Grayslake village, Illinois": "Grayslake is a village in Lake County in the U.S. state of Illinois. It is located in the Chicago metropolitan area, about 40 miles (64 km) north of Chicago's downtown, 14 miles (23 km) west of Lake Michigan, and 15 miles (24 km) south of the Wisconsin border. The village's population at the 2010 census was 20,957.<br /><br />Grayslake is home to the College of Lake County, Grayslake Central High School, Grayslake North High School, the University Center of Lake County and the Lake County Fairgrounds. There are tentative plans to develop a lifestyle shopping center on the previous location of the Lake County Fairgrounds. At the south end of Grayslake, there are plans for a 640-acre (260 ha) development containing light industry, office space and residential space.", "Green Oaks village, Illinois": "Green Oaks is a village in the Libertyville Township of Lake County, Illinois, United States. The population was 3,866 at the 2010 census.", "Greenwood village, Illinois": "Greenwood is a village in McHenry County, Illinois, United States. It was incorporated as a village on 4 April 1995. The population was 244 at the 2000 census.", "Gurnee village, Illinois": "Gurnee is a village in Lake County, Illinois, United States. Its population was 31,295 as of the 2010 census. It borders the city of Waukegan and is considered a part of the Chicago metropolitan area. It is best known for being the location of Six Flags Great America and Gurnee Mills, together drawing over 26 million visitors annually.", "Hainesville village, Illinois": "Hainesville is a village in the Avon Township of Lake County, Illinois, United States. As of the 2010 census, it had a population of 3,597. Hainesville has the distinction of being the oldest incorporated community within Lake County.", "Hampshire village, Illinois": "Hampshire is a village in Kane County, Illinois, United States.<br /><br /><br /><br />", "Hanover Park village, Illinois": "Hanover Park is a village in Cook and DuPage counties in the U.S. state of Illinois, a suburb of Chicago. The population was 37,973 at the 2010 census. Ontarioville is a neighborhood within the village.", "Harvard city, Illinois": "Harvard is a city located in McHenry County, Illinois, approximately 7 miles (11 km) south of the Illinois/Wisconsin border. The population was 9,447 at the 2010 census. The city is 63 miles (101 km) from the Chicago Loop, and it is the last stop on the Union Pacific/Northwest Line.", "Harvey city, Illinois": "Harvey is a city in Cook County, Illinois, United States, and a south suburb of Chicago. The population was 25,282 at the 2010 census. The city suffers from high levels of poverty (33.2%) and unemployment (22.0%). It also suffers from high levels of crime.<br /><br />Harvey is bordered by Dixmoor and Riverdale to the north, Dolton, Phoenix, and South Holland to the east, East Hazel Crest to the south, and Hazel Crest, Markham and Posen to the west.", "Harwood Heights village, Illinois": "Harwood Heights is a village in Cook County, Illinois, United States. The population was 8,612 at the 2010 census. The current mayor is Arlene Jezierny. She is the second woman to serve as mayor in Harwood Heights, the first being Margaret Fuller.", "Hawthorn Woods village, Illinois": "Hawthorn Woods is an affluent village in the Fremont and Ela townships of Lake County, Illinois, United States. The population was 7,663 at the 2010 census. The village is located approximately 40 miles (64 km) northwest of downtown Chicago. It was officially incorporated in 1958. Major transportation arteries include Midlothian Road, Old McHenry Road, Gilmer Road, and the Elgin, Joliet and Eastern Railway. The new Hawthorn Woods Country Club, whose golf course was designed by golf professional Arnold Palmer, is located within the village's perimeter.<br /><br /><br /><br />", "Hazel Crest village, Illinois": "Hazel Crest is a village in Cook County, Illinois, United States. The population was 14,100 at the 2010 census. The village is primarily located in Bremen Township, while the portion of the village south of 183rd Street is located in Rich Township and the portion east of I-80/94 is in Thornton Township. The village is located near Chicago in an area known as the Chicago Southland and is approximately 25 miles (40 km) south of the Chicago Loop.<br /><br />The village is bordered by Markham to the north, Harvey to the northeast, East Hazel Crest to the east, Homewood to the southeast, Flossmoor to the south and Country Club Hills to the west.", "Hebron village, Illinois": "Hebron is a village in McHenry County, Illinois, United States. As of the 2010 census the village population was 1,216, up from 1,038 in 2000.", "Hickory Hills city, Illinois": "Hickory Hills is a city in Cook County, Illinois, United States. The population was 14,049 at the 2010 census.", "Highland Park city, Illinois": "Highland Park is an affluent suburban city in Lake County, Illinois, United States, about 25 miles (40 km) north of downtown Chicago. As of the 2010 census, the population was 29,763. Highland Park is one of several municipalities located on the North Shore of the Chicago metropolitan area.", "Highwood city, Illinois": "Highwood is a city in Moraine Township, Lake County, Illinois, United States located between Chicago and Kenosha. The city is also located just south of the Fort Sheridan Forest Preserve.", "Hillside village, Illinois": "Hillside is a village in Cook County, Illinois, United States. As of the 2010 census it had a population of 8,157.", "Hinsdale village, Illinois": "Hinsdale is a village in Cook and DuPage counties in the U.S. state of Illinois. Hinsdale is a western suburb of Chicago. The population was 16,816 at the 2010 census, most of whom lived in DuPage County. The town's ZIP code is 60521. It is listed in the top 1% of wealthiest towns in Illinois, and is known locally for its beautiful residences and teardown (referring to a process in which a real estate company or individual buys an existing home and then demolishes and replaces it with a new one) culture, of which new rebuilds have taken 30% of homes in the village. The town has a rolling, wooded topography, with a quaint downtown, and is a 22-minute express train ride to downtown Chicago on the Burlington Northern line.", "Hodgkins village, Illinois": "Hodgkins is a village in Cook County, Illinois, United States. The population was 1,897 at the 2010 census.<br /><br />A large United Parcel Service facility, known as CACH, is located in Hodgkins. CACH employs over 9,000 people and is the \"largest package sorting center in the world\". The location of the CACH is typical of many major companies which require ease of transportation to locations across the United States.", "Hoffman Estates village, Illinois": "Hoffman Estates is a village in Illinois, United States. The village is located primarily in Cook County with a small section in Kane County. It is a suburb of Chicago. As of the 2010 census, the village population was 51,895. The village was incorporated in 1959.<br /><br />The village now serves as the headquarters location for the Sears Holdings Corporation, the Midwest headquarters for AT&T, and the American headquarters for Mori Seiki. The village owns the Sears Centre, home of the Chicago Slaughter of the Indoor Football League and the Windy City Bulls of the NBA D-League. In 2009, the village hosted the Heartland International Tattoo, one of the largest music and dance festivals of its kind in the Midwest.", "Holiday Hills village, Illinois": "Holiday Hills is a village in McHenry County, Illinois, United States. The population was 831 at the 2000 census.", "Homer Glen village, Illinois": "Homer Glen is a village, located 32 miles (51 km) southwest of downtown Chicago, in Homer Township, Will County, Illinois. The village was incorporated on April 17, 2001.", "Hometown city, Illinois": "Hometown is a city in Cook County, Illinois, United States. The population was 4,349 at the 2010 census.", "Homewood village, Illinois": "Homewood is a village in Cook County, Illinois, United States, and a suburb of Chicago. The population was 19,323 at the 2010 census. Homewood is a sister city to Homewood, Alabama. In 2007, Forbes magazine rated Homewood as one of the three most \"livable\" suburbs in the Chicago Metropolitan Area.", "Huntley village, Illinois": "Huntley is a village in McHenry and Kane Counties, Illinois. In 2008, the U.S. Census Bureau estimated the village's population to be 22,923. As of the 2000 Census, the village had 5,730 people, meaning the village's population had quadrupled in eight years. At the 2010 census, the village's population was 24,291. Government officials in Huntley, an outer suburb of Chicago, have adopted an aggressive development strategy regarding this population growth.<br /><br />Huntley is best known for its Premium Outlets mall and Sun City retirement community, the largest in the Midwest. The old part of Huntley is also known for its public square which features a gazebo, as well as a full brick-paved street (Woodstock St.) and 1950s-style diner, The Huntley Dairy Mart. The village's slogan is \"The Friendly Village with Country Charm.\"", "Indian Creek village, Illinois": "Indian Creek is a village in Vernon Township, Lake County, Illinois, United States. It is part of the Chicago metropolitan area and was originally incorporated in 1958 as a response to the threat of annexation by neighboring Vernon Hills. As of the 2010 census, Indian Creek's population was 462. Police services are provided by Lake County Sheriff and fire/EMS services by the Countryside Fire Protection District. During the Black Hawk War of 1832, which was the last Indian war in Illinois, Indian Creek, was the scene of a vicious attack, by a renegade band of 40-80 Potawatomi and Sauk, on the Davis Settlement, where 15 white settlers were killed and scalped.<br /><br /><br /><br />", "Indian Head Park village, Illinois": "Indian Head Park is a village in Cook County, Illinois, United States, slightly north of the intersection of Interstate 294 and Interstate 55. The village is south of Western Springs, west of Countryside, north and east of Burr Ridge. The population was 3,809 at the 2010 census. The village's ZIP code is 60525 (La Grange).", "Inverness village, Illinois": "Inverness is a suburban village in Cook County, Illinois, United States. The population was 7,399 at the 2010 census.", "Island Lake village, Illinois": "Island Lake is a village in Lake and McHenry counties in the U.S. state of Illinois. The population was 8,080 at the 2010 census.", "Itasca village, Illinois": "Itasca /aɪˈtæskə/ is a village in DuPage County, Illinois, United States. It is located approximately 27 miles northwest of downtown Chicago. It is close to O'Hare International Airport, major expressways, and rail transportation. The population was 8,649 at the 2010 census. In 2009, BusinessWeek rated Itasca as the 'Best Affordable Suburb' in the state of Illinois.", "Johnsburg village, Illinois": "Johnsburg is a northwest suburban Chicago village in McHenry County, Illinois, United States. The population was 6,337 at the 2010 census.", "Joliet city, Illinois": "Joliet (/ˈdʒoʊli.ɛt/ or /dʒoʊliˈɛt/) is a city in Kendall and Will counties in the U.S. state of Illinois, 40 miles (64 km) southwest of Chicago. It is the county seat of Will County. At the 2010 census, the city was the fourth largest in Illinois, with a population of 147,433. A special census done in 2016 puts Joliet's population at 149,395 making it the 3rd largest city in Illinois.", "Justice village, Illinois": "Justice is a village in Cook County, Illinois, United States, established in 1911. The population was 12,926 as of the 2010 census.", "Kaneville village, Illinois": "Kaneville is a village in southwestern Kane County, Illinois, United States. It was incorporated in November 2006 and the first elected officials were chosen in elections held on April 17, 2007. The village had a population of 484 at the 2010 census. Kaneville is part of the Chicago metropolitan area. The village was originally called Royalton, but this was found to be taken by another settlement. The name was then changed to Kaneville, referring to Elias Kane.", "Kenilworth village, Illinois": "Kenilworth is a village in Cook County, Illinois, United States, 15 miles (24 km) north of downtown Chicago. As of the 2010 census it had a population of 2,513. It is the newest of the nine suburban North Shore communities bordering Lake Michigan, and is one of those developed as a planned community. Kenilworth has a reputation as being the wealthiest and the most exclusive community in the Midwest. In January 2011, Forbes.com ranked Kenilworth as the second most affluent neighborhood in the United States, naming it \"the most exclusive neighborhood in the Midwest, with estimated median household income of $247,000. Even after the housing slump the average house in Kenilworth sells for about $1 million.\"", "Kildeer village, Illinois": "For the similarly named bird, see Killdeer. For the similarly named city, see Killdeer, North Dakota.<br /><br />Kildeer is an affluent village in Lake County, Illinois, United States. It is a suburb of Chicago. The population was 3,968 at the 2010 census.", "La Grange Park village, Illinois": "La Grange Park is a village in Cook County, Illinois, United States. As of the 2010 census, the village, which is a suburb of Chicago, had a population of 13,579.", "La Grange village, Illinois": "La Grange, a suburb of Chicago, is a village in Cook County, in the U.S. state of Illinois. The population was 15,550 at the 2010 census.", "Lake Barrington village, Illinois": "Lake Barrington is a village in Lake County, Illinois, United States. The population was 4,973 at the 2010 census.", "Lake Bluff village, Illinois": "Lake Bluff is a village in Shields Township, Lake County, Illinois, United States. The population was 7,469 as of 2015.", "Lake Forest city, Illinois": "Lake Forest is a city located in Lake County, Illinois, United States. As of the 2010 census it had a population of 19,375. The city is along the shore of Lake Michigan, and is a part of the Chicago metropolitan area and the North Shore. Lake Forest was founded around Lake Forest College and was laid out as a town in 1857 as a stop for travelers making their way south to Chicago. The Lake Forest City Hall, designed by Charles Sumner Frost, was completed in 1898 and originally housed the fire department, the Lake Forest Library, and city offices.", "Lake Villa village, Illinois": "Lake Villa is a village in Lake County, Illinois United States. The population was 8,741 at the 2010 census, up from 5,864 in 2000. Lake Villa lies within Lake Villa Township.", "Lake Zurich village, Illinois": "Lake Zurich is a village in Lake County, Illinois, United States, a northwest suburb of Chicago. The population was 19,631 at the 2010 census.<br /><br />The village is named after a water body named Lake Zurich which is completely located inside the village.<br /><br />In 2015, personal finance website, NerdWallet.com, rated Lake Zurich number one in Illinois for young families. In 2006, Lake Zurich was named by Frommer's as one of the top hundred \"Best Places to Raise Your Family\" and by U.S. News as one of the \"Top Twenty-five Affordable Places to Live in the Country\". In 2013, Lake Zurich achieved national recognition when Sandra Bullock's character in Gravity name-dropped the village as her character's hometown.", "Lake in the Hills village, Illinois": "Lake in the Hills (often abbreviated L.I.T.H. or LITH) is a village in McHenry County, Illinois, United States. The population was 23,152 at the 2000 census. A 2006 special census put the village's population at 29,175. As of the 2010 census, the population declined from the 2006 figure to 28,165.<br /><br />The village is most known for its rampant residential growth which occurred most heavily in the 1990s. Once a sleepy lakeside village of cottages and small ranches, its population skyrocketed as developers flocked to the area in the 1990s. Its population increased by 17,000 people (a nearly 400% increase) over this period, making it one of the most rapidly growing suburbs of Chicago and in the United States at that time. At the height of its building boom, the village issued over 1,000 residential building permits in 1995.<br /><br />In the late 1990s, the village faced the challenge of providing adequate services and infrastructure as well as establishing an identity and community unity, since many community services (libraries, schools, fire districts) were pre-delegated to neighboring communities such as Huntley, Algonquin and Crystal Lake. However, the village continues to expand its resources and community offerings and is also endeavoring to diversify its tax base and provide more commercial and industrial businesses.", "Lakemoor village, Illinois": "Lakemoor is a village in Lake and McHenry counties in the U.S. state of Illinois. The population was 6,017 at the 2010 census, up from 2,788 in 2000.", "Lakewood village, Illinois": "Lakewood is a village in McHenry County, Illinois, United States. It was incorporated as a village on July 10, 1933. The population was 3,811 at the 2010 census.", "Lansing village, Illinois": "Lansing is a village in Cook County, Illinois, United States. Lansing is a southern suburb of Chicago. The population was 28,331 at the 2010 census.", "Lemont village, Illinois": "Lemont is a village located in Cook, DuPage, and Will counties in the U.S. state of Illinois, and is a suburb of Chicago. The population was 16,000 as of the 2010 census. Lemont has a substantial immigrant population. Lemont is home to the CITGO Refinery, Argonne National Laboratory and other heavy industrial sites.", "Libertyville village, Illinois": "Libertyville is a village in Lake County, Illinois, United States and an affluent suburb of Chicago. It is located 5 miles (8 km) west of Lake Michigan on the Des Plaines River. The 2014 census population was 20,512. (There is also a township of the same name, which includes the village and some surrounding areas.) Located in northeastern Illinois, southwest of Waukegan and west of Lake Forest, its immediate neighbors are Mundelein to the west, Green Oaks, Mettawa, and Rondout to the east, Gurnee to the north, Grayslake to the northwest, and Vernon Hills to the south.", "Lily Lake village, Illinois": "Lily Lake is a village in Kane County, Illinois, United States. The town is 11 miles southwest of Elgin and 43 miles west of Chicago. The village is part of the Chicago metro area. It was incorporated as a village on November 6, 1990. The population was 993 at the 2010 census, up from 825 in 2000.", "Lincolnshire village, Illinois": "Lincolnshire is a village in Vernon Township, Lake County, in the U.S. state of Illinois. The village is a northern suburb of Chicago. The population of Lincolnshire was 7,275 at the 2010 census. Lincolnshire was incorporated on August 5, 1957, from the unincorporated Half Day area when land was purchased to build a residential subdivision. The community underwent an aggressive era of expansion from 1983 to the 1990s. The Des Plaines River bisects the village, passing from north to south; Illinois Route 22 also divides the village into two parts, crossing the village from east to west.<br /><br />Lincolnshire is home to the public Adlai E. Stevenson High School and to the schools that compose the elementary Lincolnshire-Prairie View School District 103. It serves as the headquarters for corporations including the global outsourcing company Aon Hewitt, and was the base of operations for the Newman/Haas Racing team. The village of Lincolnshire hosts several annual festivals (including one mirroring the Taste of Chicago) in either commercial establishments such as City Park or the Village Green, or in one of its nine public parks. The village maintains a police department that closely collaborates with its local school districts. Lincolnshire manages a public works system at the direct expense of the village; it retrieves all of its water from the city of Highland Park, which derives its water from adjacent Lake Michigan. The village has a council–manager government and is a home-rule municipality. The mayor of Lincolnshire is Elizabeth J. Brandt.", "Lincolnwood village, Illinois": "Lincolnwood (formerly Tessville) is a village in Cook County, Illinois, United States. The population was 12,590 at the 2010 census.", "Lindenhurst village, Illinois": "Lindenhurst is a village in Lake County, Illinois, United States. The population was 14,462 at the 2010 census. Lindenhurst lies within Lake Villa Township.<br /><br /><br /><br />", "Lisle village, Illinois": "Lisle (/ˈlaɪəl/ LY-UL) is a village in DuPage County, Illinois, United States. The population was 21,182 at the 2000 census. It is part of the Chicago metropolitan area and the Illinois Technology and Research Corridor. It is also the headquarters of the Nuclear Regulatory Commission Region III.<br /><br />In July 2007, Lisle was ranked #20 in Money magazine's list of \"100 Best Places to Live\" and #17 on their 2009 list of the \"Best Places for the Rich and Single\".", "Lockport city, Illinois": "Lockport is a city in Will County, Illinois, United States, located 30 miles southwest of Chicago. Lockport was listed on the National Register of Historic Places on May 12, 1975. The city was incorporated in 1853 and is situated along the Illinois and Michigan (I&M) Canal. Recently, it was named one of the fastest-growing suburbs in America, by Forbes Magazine. The scenic golf course, walking paths, vintage downtown, parks and recreation and accessibility to I-355 and 80 add to the city's appeal.<br /><br />Lockport was the headquarters of the operationally defunct Illinois and Michigan Canal. A section of the canal runs through Lockport, including the remains of the canal's Lock No. 1 from which the town received its name. The canal right-of-way is now the Illinois and Michigan National Heritage Corridor. Because of proactive efforts dating back several years, the city of Lockport is one of the best-preserved Canal sites in existence today.", "Lombard village, Illinois": "Lombard is a village in DuPage County, Illinois, United States, and a suburb of Chicago. The population was 42,322 at the 2000 census. The United States Census Bureau estimated the population in 2004 to be 42,975. The village's challenge to the Census Bureau regarding its official 2010 population was accepted, revising the official population of the village from 43,165 to 43,395.", "Long Grove village, Illinois": "Long Grove is an affluent village in Lake County, Illinois, United States, approximately 35 miles (56 km) northwest of Chicago. As of the 2010 census, the village had a population of 8,043. The village has strict building ordinances to preserve its \"country atmosphere\".", "Lynwood village, Illinois": "Lynwood is a village in Cook County, Illinois, United States. The population was 9,007 at the 2010 census.<br /><br />Lynwood was founded in 1959. The village is bordered by Lansing to the north, Glenwood to the west, Ford Heights and Sauk Village to the south, and Munster and Dyer, Indiana, to the east. The Indiana state line borders the entire eastern edge of Lynwood. Lynwood is currently a mix of suburban neighborhoods with a substantial amount of remaining farmland.", "Lyons village, Illinois": "Lyons (also known as Lyons Township) is a village in Lyons Township Cook County, Illinois, United States. The population was 10,729 at the 2010 census. The Chicago Portage National Historic Site is located in Lyons.", "Manhattan village, Illinois": "Manhattan is a village in Will County, Illinois, United States. The population was 6,071 at the 2006 special census. The U.S. Census Bureau estimates the population to be 7,093 as of 2011. The community is located in northeastern Illinois approximately 50 miles southwest of Chicago.<br /><br /><br /><br />", "Maple Park village, Illinois": "Maple Park is a village in DeKalb and Kane counties in the U.S. state of Illinois. The population was 1,310 at the 2010 census, up from 765 in 2000. Maple Park was formerly known as Lodi.", "Marengo city, Illinois": "Marengo is a city in McHenry County, Illinois, United States. The population was 7,648 at the 2010 census.", "Markham city, Illinois": "Markham is a suburban city in Cook County, Illinois, United States. The population was 12,508 at the 2010 census.", "Matteson village, Illinois": "Matteson /ˌmætɪsən/ is a village in Cook and Will counties, Illinois, United States. The population was 12,928 at the 2000 census and 19,009 in 2010.", "Maywood village, Illinois": "Maywood is a village in Proviso Township, Cook County, Illinois, United States. It was founded on April 6, 1869, and organized October 22, 1881. The population was 24,090 at the 2010 United States Census.", "McCook village, Illinois": "McCook is a suburb of Chicago in Cook County, in the U.S. state of Illinois. As of the 2010 census, the village population was 228, which is the lowest population of all municipalities in the county. It was named for John J. McCook, a late 19th-century director of the Santa Fe Railroad and a former Civil War officer. The railway stopped at a small station in McCook.<br /><br /><br /><br />", "McCullom Lake village, Illinois": "McCullom Lake is a village in McHenry County, Illinois, United States. The population was 1,049 at the 2010 census.", "McHenry city, Illinois": "McHenry is a city in McHenry County, Illinois, United States. The 2010 U.S. census reported its population at 26,992. McHenry was at one time the county seat of McHenry County, which once included adjoining Lake County to the east. McHenry took its name from McHenry County, which was named for Major William McHenry, an Indian fighter.<br /><br />McHenry is surrounded by natural lakes and streams, grassy moraine hills, gravel banks and shallow nutrient-rich peat bogs, remnants of receding glaciers from the last ice age. Moraine Hills State Park and Volo Bog State Natural Area preserve some of these natural features.", "Melrose Park village, Illinois": "Melrose Park is a village in Cook County, Illinois, United States. It is a suburb of Chicago,14 miles by road. As of the 2010 census it had a population of 25,411. Melrose Park has long been home to a large Italian-American population.<br /><br />The suburb was the home of Kiddieland Amusement Park from 1929 until 2010 (it closed in September 2009 before it was demolished), and the current home of Maywood Park Racetrack, the Shrine of Our Lady of Mt. Carmel, and Stern Pinball, Inc., which is now the world's last manufacturer of coin-operated pinball machines.<br /><br />There is a Metra railroad station in Melrose Park with daily service to Chicago. Melrose Park is home to two hospitals, Westlake Hospital and Gottlieb Memorial Hospital.", "Merrionette Park village, Illinois": "Merrionette Park is a village in Cook County, Illinois, United States. The population was 1,900 as of the 2010 census.", "Mettawa village, Illinois": "Mettawa is a village in Lake County, Illinois, United States, dedicated to preserving open lands and low-density residential development. As of the 2010 census, it had a population of 547. The village maintains trails for pedestrian, bicycle and equestrian usage. Five forest preserves of the Lake County Forest Preserve District are located within village boundaries.", "Midlothian village, Illinois": "Midlothian (/mɪdˈloʊθiən/) is a village in Cook County in the state of Illinois, United States. It is a southwestern suburb of Chicago.", "Minooka village, Illinois": "Minooka, a suburb of Chicago, is a village in Grundy, Kendall, and Will counties, Illinois, United States. The population was 10,924 at the 2010 census. Minooka currently has two high schools in its district, a campus for juniors and seniors and a newer campus for freshmen and sophomores. Minooka Community Consolidated School District 201 (elementary district) has a total of seven schools and serves nearly 4000 students. Minooka has continuously been growing and has many new subdivisions. The Rock Island Line served the town at Minooka Station.", "Mokena village, Illinois": "Mokena is a village in Will County, Illinois, United States. The population was 14,583 at the 2000 census. As of 2010, the population was 18,740.", "Monee village, Illinois": "Monee is a village in Will County, Illinois, United States. The population was 5,148 at the 2010 census.<br /><br />Plans for a new Metra station on 2nd Avenue are undergoing studies. In 2016, the River Valley Metro will begin making stops here as well as in nearby Peotone. A proposed Pace bus route will run from the University Park Metra station to the new station.", "Montgomery village, Illinois": "Montgomery is a village in Kane and Kendall counties, Illinois. The population was 5,471 at the 2000 census, while the 2010 census lists Montgomery's population at 18,438. This is a 237 percent increase from 2000, making Montgomery the 9th fastest growing municipality in Illinois during this period.", "Morton Grove village, Illinois": "Morton Grove is a village in Cook County, Illinois, United States. As of the 2010 census, the population was 23,270, for a growth rate of 3.6% since 2000.<br /><br />The Village of Morton Grove is represented by a governing board consisting of a Village President and six Village Trustee. The President and Trustee are elected to four-year terms. The Village President is the presiding officer of Village Board meetings. The President is also the chief executive officer of the Village. The Village President of Morton Grove since May 13, 2013, is Mayor Daniel P. DiMaria.<br /><br />Regularly scheduled Board meetings are held on the second and fourth Mondays of each month, beginning with a closed door executive session at 6:00 PM. The Village Board is the governing body of the Village and exercises all powers entrusted to it under Illinois statutes. These include police powers related to the health, safety and welfare of the community.<br /><br />The village is named after former United States Vice President Levi Parsons Morton, who was the driving force behind allowing the old Miller's Mill road (now Lincoln Avenue) to pass through the upstart neighborhood, and provide goods to trade and sell. Morton Grove was incorporated in December 1895.<br /><br />The village serves as the headquarters for Alpha Delta Phi fraternity.", "Mount Prospect village, Illinois": "Mount Prospect is a village in Elk Grove and Wheeling Townships in Cook County, Illinois, about 22 miles (35 km) northwest of downtown Chicago. As of the 2010 census, the village had a total population of 54,167.", "Mundelein village, Illinois": "Mundelein is a village in Lake County, Illinois, United States and a northern suburb of Chicago. As of the 2010 census, the village population was 31,064. It is approximately thirty-five miles northwest of Chicago.", "Naperville city, Illinois": "Naperville is a city in DuPage and Will counties in the U.S. state of Illinois, and a suburb of Chicago. Naperville was voted the second-best place to live in the United States by Money magazine in 2006. It was rated 1st on the list of best cities for early retirement in 2013 by Kiplinger. In a 2010 study, Naperville was named the wealthiest city in the Midwest and eleventh in the nation with a population over 75,000. It was ranked among the nation's safest cities by USAToday and Business Insider. As of the 2010 census, the city had a population of 141,853, which was estimated to have increased to 147,100 by July 2015. It is the fifth-largest city in Illinois.", "New Lenox village, Illinois": "New Lenox is a village in Will County, Illinois, United States. The village population was 24,394 as of 2010. According to a 2011 forecast the Chicago Metropolitan Agency for Planning estimated New Lenox will have a population of 90,652 in 2030. However, due to a substantial slow down in area growth, a 2015 forecast estimates the population of New Lenox will grow to about 68,000 residents by 2040.", "Niles village, Illinois": "Niles is a village in Maine and Niles townships, Cook County, Illinois, United States. The 2010 population from the U.S. Census Bureau was 29,803.<br /><br />The current mayor of Niles is Andrew Przybylo.", "Norridge village, Illinois": "Norridge is a village in Cook County, Illinois, United States. The population was 14,572 at the 2010 census.<br /><br />The village and its neighbor to the east, Harwood Heights, together form an enclave within the city of Chicago (i.e. they are completely surrounded by the city). Norridge is sometimes referred to as the \"Island Within a City\". A history book of the same name was written by Norridge author Tom McGowen.", "North Aurora village, Illinois": "North Aurora is a village and Chicago suburb in Kane County, Illinois, United States. It had a population of 16,760 at the 2010 census. North Aurora maintains its own public library district, fire district, and police department, but public spaces and parks are managed by the neighboring Fox Valley Park District.", "North Barrington village, Illinois": "North Barrington is a village in Lake County, Illinois, United States. The population was 3,047 at the 2010 census.", "North Chicago city, Illinois": "North Chicago is a city in Lake County, Illinois, United States, and an outer suburb of the Chicago metropolitan area. The population was 32,574 at the 2010 census.<br /><br />North Chicago hosts the Great Lakes Naval Training Center and the headquarters of Abbott Laboratories and AbbVie.<br /><br />The city is also home to Rosalind Franklin University of Medicine and Science, which houses the Chicago Medical School, the Dr. William M. Scholl College of Podiatric Medicine, the College of Pharmacy, the College of Health Professions, and the School of Graduate and Postdoctoral Studies.", "North Riverside village, Illinois": "North Riverside is a village in Cook County, Illinois, United States. As of the 2010 census, it had a population of 6,672.", "Northbrook village, Illinois": "Northbrook is an affluent village on Chicago's North Shore, located at the northern edge of Cook County, Illinois, United States.<br /><br />When incorporated in 1901, the village was known as Shermerville in honor of Frederick Schermer, who donated the land for its first train station. The village changed its name to Northbrook in 1923 as an effort to improve its public image. The name was chosen because the West Fork of the North Branch of the Chicago River runs through the Village.<br /><br />Glenbrook North High School, founded in 1953 as Glenbrook High School, is located in Northbrook. The village is also home to the Northbrook Park District, founded in 1927, Northbrook Court shopping mall, the Ed Rudolph Velodrome, the Chicago Curling Club, and the Northbrook Public Library.", "Northfield village, Illinois": "Northfield is an affluent village in Cook County, Illinois, United States, located approximately 19 miles (31 km) north of downtown Chicago. It is part of a collection of upscale residential communities north of Chicago that belong to New Trier Township and the greater North Shore. As of the 2010 census, the village's population was 5,420.", "Northlake city, Illinois": "Northlake is a city in Cook County, Illinois, United States. The population was 12,323 at the 2010 census. The city's moniker is \"The City of Friendly People\". The name \"Northlake\" came from two streets, North Avenue and Lake Street.", "Oak Brook village, Illinois": "Oak Brook is an affluent village in DuPage County with a small portion in Cook County in Illinois. The population was 7,883 at the 2010 census. A suburb of Chicago, Oak Brook serves as home to the headquarters of several notable companies and organizations including McDonald's (now moving to Chicago), Ace Hardware, Blistex, Federal Signal, CenterPoint Properties, Sanford L.P., TreeHouse Foods, and Lions Clubs International.", "Oak Forest city, Illinois": "Oak Forest is a suburban city about 24 miles (39 km) south-southwest of downtown Chicago in Bremen Township in Cook County, Illinois, United States. The population was 27,962 at the 2010 census.", "Oak Lawn village, Illinois": "Oak Lawn is a village in Cook County, Illinois, United States. The population was 56,690 at the 2010 census.<br /><br />Oak Lawn is a suburb of Chicago, located southwest of the city. It shares borders with the city in two areas, but is surrounded mostly by other suburbs.", "Oak Park village, Illinois": "Oak Park is a village adjacent to the West Side of the city of Chicago in Cook County, Illinois, United States. It is the 29th largest municipality in Illinois as measured by population in the 2010 US Census, and has easy access to downtown Chicago (the Chicago Loop) via public transportation including the CTA Blue and Green lines, buses, and Metra commuter rail. Pace buses serve the Village for travel within its borders and connecting to neighboring suburbs. As of the 2010 United States Census the Village had a total population of 51,878.<br /><br />Oak Park was settled beginning in the 1830s, with rapid growth later in the 19th century and early 20th century. It incorporated in 1902, breaking off from Cicero. Development was spurred by railroads and street cars connecting the village to jobs in Chicago. Famed architect Frank Lloyd Wright and his wife settled here in 1889. Population peaked at 66,015 in 1940. Smaller families led to falling population in the same number of homes and apartments. In the 1960s, Oak Park faced the challenge of racial integration, devising many strategies to integrate rather than re-segregate the village, which so far are successful. Oak Park includes three historic districts for the historic homes: Ridgeland, Frank Lloyd Wright and Seward Gunderson, reflecting the focus on historic preservation. Many people of national fame have been born here, or lived here while building their own families and careers, including Frank Lloyd Wright, Ernest Hemingway, Ray Kroc, Bob Newhart, Betty White and Dan Castellaneta.", "Oakbrook Terrace city, Illinois": "Oakbrook Terrace is a city in DuPage County, Illinois, a suburb of Chicago. As of the 2010 census, the city had a total population of 2,134, which was estimated to have increased to 2,155 by July 2012.", "Oakwood Hills village, Illinois": "Oakwood Hills is a village in McHenry County, Illinois, United States. Oakwood Hills was founded in 1959. The population was 2,194 at the 2000 census. As of 2010, the population dropped to 2,083.", "Old Mill Creek village, Illinois": "Old Mill Creek is a village in Lake County, Illinois, United States. The population was 178 at the 2010 census.", "Olympia Fields village, Illinois": "Olympia Fields is a village in Cook County, Illinois, United States. The population was 4,988 at the 2010 census. The municipality grew up around the prestigious Olympia Fields Country Club, originally established in 1915.<br /><br />Olympia Fields is noteworthy as one of the wealthiest and best educated \"majority black\" communities in the United States; the village's ZIP Code (60461) is one of three with a majority African American population that ranks among the top five percent in the U.S. as a whole for median household income and for the share of adults with college degrees.", "Orland Hills village, Illinois": "Orland Hills (formerly Westhaven) is a village in Cook County, Illinois, United States. The population was 7,149 at the 2010 census.<br /><br /><br /><br />", "Orland Park village, Illinois": "Orland Park is a village in Cook County, Illinois, United States, and a middle-class suburb of Chicago which in 2010 had a population of 56,767.<br /><br />25 miles (40 km) southwest of Chicago, Orland Park is close to several interstate highways, with the I-80 east-west coast connector as its southern border. The Metra commuter rail system links it to the Chicago Loop and from there to O'Hare and Midway airports.", "Palatine village, Illinois": "Palatine (/ˈpælətaɪn/) is a village in Cook County, Illinois, United States. It is a northwestern residential suburb of Chicago. As of the 2000 census, the village had a total population of 65,479. In the 2010 census its population had risen to 68,557, making it the seventh-largest community in Cook County and the 18th-largest in the state of Illinois.", "Palos Heights city, Illinois": "Palos Heights is a city in Cook County, Illinois, United States. The population was 12,515 at the 2010 census.", "Palos Hills city, Illinois": "Palos Hills is a city in Cook County, Illinois, United States. It is a southwest suburb of Chicago. The population was 17,484 at the 2010 census. It is the home of Moraine Valley Community College as well as Amos Alonzo Stagg High School.", "Palos Park village, Illinois": "Palos Park is an affluent village in southwestern Cook County, Illinois, United States. The population was 4,847 at the 2010 census.", "Park City city, Illinois": "Park City is a small city located in the Warren and Waukegan townships of Lake County, Illinois, United States. The population was 7,570 at the 2010 census.", "Park Forest village, Illinois": "Park Forest is a village located south of Chicago in Cook and Will counties, Illinois, United States. As of the 2010 census, the village had a population of 21,975. Park Forest is bordered by Olympia Fields to the north, Chicago Heights to the east, University Park to the south (formerly Park Forest South), and Richton Park and Matteson to the west.", "Park Ridge city, Illinois": "Park Ridge is a city in Cook County, Illinois, United States, and a Chicago suburb. The population was 37,480 at the 2010 census. It is located 15 miles (24 km) northwest of downtown Chicago. It is close to O'Hare International Airport, major expressways, and rail transportation. It is a part of the Chicago metropolitan area, bordering two northwestern neighborhoods of Chicago's Far North Side (Edison Park and Norwood Park).<br /><br />As its name suggests, Park Ridge lies on a ridge. The soil is abundant with clay deposits, which made it a brick-making center for the developing city of Chicago. Park Ridge was originally called Pennyville to honor George Penny, the businessman who owned the local brickyard along with Robert Meacham. Later it was named Brickton. The Des Plaines River divides Park Ridge from neighboring Des Plaines, Illinois, which is west of Park Ridge. Chicago is south and east of Park Ridge, and Niles and unincorporated Maine Township are to its north.", "Peotone village, Illinois": "Peotone (/ˈpiːoʊtoʊn/) is a village in Will County, Illinois, United States. The population was 4,142 at the 2010 census, an increase from 3,385 in 2000. The city is about 43 miles (69 km) south of Chicago. The city is home to the Peotone High School Blue Devils.", "Phoenix village, Illinois": "Phoenix is a village in Cook County, Illinois, United States. The population was 1,964 at the 2010 census. It is located approximately 19 miles (31 km) south of the Chicago Loop and is part of the Chicago–Naperville–Joliet, IL-IN-WI Metropolitan Statistical Area.<br /><br /><br /><br />", "Pingree Grove village, Illinois": "Pingree Grove is a village in Kane County, Illinois, United States. The population was 124 at the 2000 census. However, rapid development in recent years has resulted in explosive growth, and the 2010 census indicated 4,532 residents. In the next decade, the population is expected to reach 15,000 as farmlands are developed into new housing units. Pingree Grove is becoming known as a \"Green Town\", being environmentally friendly.", "Plainfield village, Illinois": "Plainfield is a village in Will County, Illinois, United States. The US Census Bureau estimates the population at 41,734 as of 2013.<br /><br />The village includes land in Plainfield and Wheatland townships. Part of Plainfield is located in Kendall County (Na-Au-Say and Oswego townships). With the growth in the Chicago suburbs in the 1990s and 2000s, the village has seen a population increase, from 4,500 in 1990 to 28,000 in 2000 to over 37,000 in 2007.<br /><br />The village has established a community Preservation Commission and historic preservation ordinance. It is the home of the Lake Renwick Preserve, a county forest preserve used for birdwatching and other activities.", "Port Barrington village, Illinois": "Port Barrington is a village in Lake and McHenry counties in the U.S. state of Illinois. It was formerly known as Fox River Valley Gardens. Fox River Valley Gardens' village board voted 4-3 in September 2002 to change the community's long name to Port Barrington. Supporters said they hoped the name change would boost property values by associating it with other nearby Barrington area communities. The population was 1,517 at the 2010 census, up from 788 in 2000.", "Posen village, Illinois": "Posen is a village in Cook County, Illinois, United States. Posen is the German-language name for the western Polish city of Poznań. The population of the village was 5,987 at the 2010 census, up from 4,730 in 2000.", "Prairie Grove village, Illinois": "Prairie Grove is a village in McHenry County, Illinois, United States, first incorporated in 1973. The population was 1,904 at the 2010 census. Prairie Grove's schools and main social and economic life are shared with the city of Crystal Lake.<br /><br /><br /><br />", "Prospect Heights city, Illinois": "Prospect Heights is a city in Cook County, Illinois, United States and is a suburb of Chicago. The population was 16,256 at the 2010 census.", "Richmond village, Illinois": "Richmond is a village in McHenry County, Illinois, United States, 44 miles south-southwest of Milwaukee, Wisconsin and 55 miles northwest of Chicago. The population was 1,901 at the 2010 census. Richmond will be the site for the Chicago Super and Sprint Weekend event, June 11 - 12, 2017, part of the Reebok Spartan Race.", "Richton Park village, Illinois": "Richton Park is a village in Cook County, Illinois, United States. The population was 13,646 at the 2010 census.", "Ringwood village, Illinois": "Ringwood is a village in McHenry County, Illinois, United states. The population was 836 at the 2010 census.", "River Forest village, Illinois": "River Forest is an affluent suburban village in Cook County, Illinois, United States. Two universities make their home in River Forest, Dominican University and Concordia University Chicago. The village is closely tied to the larger neighboring community of Oak Park. There are significant architectural designs located in River Forest such as the Winslow House by Frank Lloyd Wright. The population of the village was 11,172 at the 2010 census.<br /><br />River Forest has a railroad station with service to Chicago on Metra's Union Pacific/West Line.", "River Grove village, Illinois": "River Grove is a village in Cook County, Illinois, United States. The population was 10,227 at the 2010 census.", "Riverdale village, Illinois": "Riverdale is a village in Cook County, Illinois, United States. The population was 13,549 at the 2010 census.", "Riverside village, Illinois": "Riverside is a suburban village in Cook County, Illinois, United States. A significant portion of the village is in the Riverside Landscape Architecture District, designated a National Historic Landmark in 1970. The population of the village was 8,875 at the 2010 census. It is a suburb of Chicago, located roughly 9 miles (14 km) west of downtown Chicago and 2 miles (3 km) outside city limits.", "Riverwoods village, Illinois": "Riverwoods is a village in Lake County, Illinois, United States. It was established on the banks of the Des Plaines River in 1949 by local steel magnate Jay Peterson. The population was 3,660 at the 2010 census. The corporate headquarters of Discover Financial and CCH are located there, as well as Orphans of the Storm, an animal shelter founded in 1928 by famous dancer Irene Castle. The village hosts the annual \"Arts & Riverwoods\" festival.", "Robbins village, Illinois": "Robbins is a village in Cook County, Illinois, United States. The population was 5,337 at the 2010 census, down from 6,635 in 2000. Tyrone Ward is the current mayor.", "Rockdale village, Illinois": "Rockdale is a village in Will County, Illinois, United States. The population was 1,976 at the 2010 census.", "Rolling Meadows city, Illinois": "Rolling Meadows is a city in Cook County, Illinois, United States. The population was 24,099 at the 2010 census.", "Romeoville village, Illinois": "Romeoville is a village in Will County, Illinois, United States. The village is located 26 miles (42 km) southwest of Chicago. The population was 39,680 at the 2010 census. It is located in the southwest suburban area of Chicago near the newly constructed I-355 extension south from the Stevenson Expressway (I-55) to I-80. It is the state's 19th largest village.<br /><br /><br /><br />", "Roselle village, Illinois": "Roselle is a village in DuPage County and Cook counties in northeastern Illinois, United States. It was first incorporated in 1922 and is a bedroom community, with residents generally commuting to Chicago or nearby suburbs for their jobs. As a result, the early rural atmosphere of the community has been lost over the past 30 years. As of the 2010 census, the village's population was 22,763. Roselle is a western suburb of Chicago and is part of the Chicago metropolitan area.", "Rosemont village, Illinois": "Rosemont is a village in Cook County, Illinois, United States, located immediately northwest of Chicago. As of the 2010 census it had a population of 4,202. The village was incorporated in 1956, though it had been settled long before that. While Rosemont's land area and population are relatively small among municipalities in the Chicago Metropolitan Area, the village is a major center for commercial activity in the region and is a key component of the Golden Corridor.<br /><br />Due to its proximity to several interstates, O'Hare International Airport, and downtown Chicago, it has emerged as a significant edge city and entertainment district, with corporate facilities, millions of square feet of office space, nearly 50 restaurants, 15 hotels, the 840,000-square-foot (78,000 m2) Donald E. Stephens Convention Center (home to conventions and trade shows), the 16,000+ seat Allstate Arena (home to the Chicago Wolves, Chicago Sky, DePaul Blue Demons, and concerts and other live entertainment events), the 4,000+ seat Rosemont Theatre, the 130-store Fashion Outlets of Chicago, the Rosemont Stadium (home to an outdoor collegiate-level baseball stadium and 140,000 sq ft indoor sports dome), and the entertainment complex MB Financial Park, which features restaurants, entertainment and a large common area used for summer concerts and ice skating in the winter. Rosemont is near Rivers Casino in Des Plaines and additional hotels, offices, restaurants, and corporate facilities in the adjacent O'Hare neighborhood of Chicago and nearby suburban communities such as Des Plaines and Schiller Park.<br /><br />The residential sections of Rosemont are a gated community, as a result of the 1995 decision by residents to enclose the residential portions of the city (roughly half the area of the city), thereby restricting access to locals.", "Round Lake Beach village, Illinois": "Round Lake Beach is a northern suburb of Chicago in Lake County, Illinois, United States. The population was 28,175 at the 2010 census.", "Round Lake Heights village, Illinois": "Round Lake Heights is a village in Lake County, Illinois, United States. The population was 2,676 at the 2010 census, up from 1,347 in 2000.", "Round Lake Park village, Illinois": "Round Lake Park is a village in Lake County, Illinois, United States. The population was 7,505 at the 2010 census.", "Round Lake village, Illinois": "Round Lake is a northern suburb of Chicago in Lake County, Illinois, United States. As of the 2010 census, it had a population of 18,289.", "Sauk Village village, Illinois": "Sauk Village is a village in Cook County, Illinois, United States, with a small portion in Will County. The population was 10,506 at the 2010 census.", "Schaumburg village, Illinois": "Schaumburg /ˈʃɔːmbərɡ/ is a village located in Cook County in northeastern Illinois, United States. The village is a northwestern suburb of Chicago and is part of the Golden Corridor. Schaumburg is located roughly 28 miles (45 km) northwest of the Chicago Loop and approximately 10 miles (16 km) northwest of O'Hare International Airport. As of the 2010 census, the village had a total population of 74,227.<br /><br />The village contains one of only two IKEA stores in Illinois. It contains the Woodfield Mall, the 11th largest mall in The United States according to List of largest shopping malls in the United States, which at most times has over 300 stores. Schaumburg's transition from a rural community to that of a suburban metropolis began with Alfred Campanelli's first large scale suburban-style development in 1959 and Woodfield Mall's opening on September 9, 1971.<br /><br />Schaumburg is bordered by Hoffman Estates and Palatine to the north, Rolling Meadows to the northeast, Elk Grove Village to the southeast, Roselle to the south, Hanover Park to the southwest, and Streamwood to the west.", "Schiller Park village, Illinois": "Schiller Park is a village in Cook County, Illinois, United States. The population was 11,793 at the 2010 census.", "Shorewood village, Illinois": "Shorewood is a village in Troy Township, Will County, Illinois, United States. The population was 7,686 at the 2000 census, and estimated to be 15,615 as of 2010.", "Skokie village, Illinois": "Skokie (/ˈskoʊki/; formerly Niles Center) is a village in Cook County, Illinois, United States. Its name comes from a Potawatomi word for \"marsh\". A Chicago suburb, for many years Skokie promoted itself as \"The World's Largest Village\". Its population, according to the 2010 census, was 64,784. Skokie's streets, like that of many suburbs, are largely a continuation of the Chicago street grid, and the village is served by the Chicago Transit Authority, further cementing its connection to the city.<br /><br />Skokie was originally a German-Luxembourger farming community, but was later settled by a sizeable Jewish population, especially after World War II. At its peak in the mid-1960s, 58% of the population was Jewish, the largest percentage of any Chicago suburb. In recent years, several synagogues and Jewish schools have closed. However, Skokie still has a very large Jewish population. It is home to the Illinois Holocaust Museum and Education Center, which opened in northwest Skokie in 2009.<br /><br />Skokie has received national attention twice for court cases decided by the United States Supreme Court. In the mid-1970s, it was at the center of a case concerning the First Amendment right to assemble and the National Socialist Party of America, a neo-Nazi group. Skokie ultimately lost that case. In 2001, although Skokie was not a direct party to the case, a decision by the village regarding land use led the court to reduce the power of the United States Environmental Protection Agency. In October 2013, Skokie was rated #71 on America's top 100 places to live on the livability.com website.", "Sleepy Hollow village, Illinois": "Sleepy Hollow is a village in Kane County, Illinois, United States 30 miles northwest of Chicago. The population was 3,553 at the 2000 census.<br /><br />Various streets in the village are named after characters in Washington Irving's The Legend of Sleepy Hollow. Other streets are named after trees. Still other streets, particularly in the subdivision of Saddle Club Estates, are named after horse racing tracks. These street names include Saratoga, Churchill, Arlington and Belmont. Carol Crest is named after a resident on that street. The family was asked what they wanted the name of their street. The husband suggested Carol for his wife, hence Carol Crest.", "South Barrington village, Illinois": "South Barrington is a village in Cook County, Illinois, United States, south of Barrington. The population was 4,565 at the 2010 census. South Barrington is a wealthy suburb of Chicago and home to the famous megachurch Willow Creek Community Church. The Arboretum of South Barrington is a lifestyle center (shopping center) located within the village limits.", "South Chicago Heights village, Illinois": "South Chicago Heights is a village in Cook County, Illinois, United States. The population was 4,139 at the 2010 census.", "South Elgin village, Illinois": "South Elgin is a village in Kane County, Illinois, United States. The population was 16,100 at the 2000 census, and estimated to be 20,758 as of 2005. In July 2007, Money magazine named South Elgin as 82nd of 100 entries in its \"America's Best Places To Live\" edition.", "South Holland village, Illinois": "South Holland is a village in Cook County, Illinois, United States, within Thornton Township. The population was 22,030 at the 2010 census.", "Spring Grove village, Illinois": "Spring Grove is a village in McHenry County, Illinois, United States. The population was 5,778 according to the 2010 census, up from 5,303 in 2005 and 3,880 in 2000. It is also home to Chain O'Lakes State Park.<br /><br />The current village president is Mark Eisenberg.<br /><br />The first tower grain silo was built in Spring Grove in 1873.<br /><br /><br /><br />", "St. Charles city, Illinois": "St. Charles is a city in DuPage and Kane counties in the U.S. state of Illinois. It lies roughly 40 miles (64 km) west of Chicago on Illinois Route 64. According to a U.S. Census Bureau estimate in July 2012, the city had a total population of 33,327. The official city slogan is Pride of the Fox, after the Fox River that runs through the center of town. St. Charles is part of a tri-city area along with Geneva and Batavia, all western suburbs of similar size and relative socioeconomic condition.", "Steger village, Illinois": "Steger is a village that straddles the border which separates Cook County and Will County, Illinois (Steger Road is the border line). It is 35 miles (56 km) south of Chicago and had a population at the 2010 census of 9,570.", "Stickney village, Illinois": "Stickney is a village in Cook County, Illinois, United States. The village is named for Alpheus Beede Stickney, a railroad executive who played a central role in establishing the Clearing Industrial District. The population was 6,786 at the 2010 census. It was well known in the 1920s and early 1930s as the home for several bordellos linked to mobster Al Capone's empire.<br /><br />The largest wastewater treatment plant in the world, the Stickney Water Reclamation Plant (Stickney WRP), is located within the village. This facility is operated by the Metropolitan Water Reclamation District of Greater Chicago.", "Stone Park village, Illinois": "Stone Park is a village in Cook County, Illinois, United States. The population was 4,946 at the 2010 census. Incorporated in 1939, the town was named for insurance magnate Clement Stone, who bought most of the land when it was still corn fields.", "Streamwood village, Illinois": "Streamwood is a village of Cook County, Illinois, United States. The population was 39,858 at the 2010 census. It is a northwest suburb of Chicago, and is a part of the Chicago metropolitan area.<br /><br />Streamwood is one of the three communities that make up the so-called \"Tri Village\" area, along with Bartlett and Hanover Park. Streamwood was first incorporated as a village on February 9, 1957.", "Sugar Grove village, Illinois": "Sugar Grove is a far west suburban Chicago village in Kane County, Illinois, United States. The population was 3,909 at the 2000 census. The population was 6,016 in the 2003 special census. The population was 7,958 in the 2005 special census. The 2010 census population is 8,997.", "Summit village, Illinois": "Summit (or Summit-Argo) is a village in Cook County, Illinois, United States. The population was 11,054 at the 2010 census. The village is arguably best known as the setting to Ernest Hemingway's 1927 short story \"The Killers\".", "Symerton village, Illinois": "Symerton is a village in Will County, Illinois, United States. The population was 106 at the 2000 census. In 2003, the estimated population was 111. By population, it is the smallest village in Will County.", "Third Lake village, Illinois": "Third Lake is a village in Lake County, Illinois, United States. The population was 1,182 at the 2010 census.", "Thornton village, Illinois": "Thornton is a village in Cook County, Illinois, United States. The population was 2,338 at the 2010 census. Thornton is home to the Thornton Quarry, one of the largest quarries in the world.", "Tinley Park village, Illinois": "Tinley Park is a village located in Cook County, Illinois, United States, with a small portion in Will County. The population was 56,703 at the 2010 census. It is one of the fastest growing suburbs south of Chicago. In 2009, Tinley Park was selected by BusinessWeek as the best place to raise a family in America.", "Tower Lakes village, Illinois": "Tower Lakes is a village in Lake County, Illinois, United States. The population was 1,283 at the 2010 census.", "Trout Valley village, Illinois": "Trout Valley is a village in McHenry County, Illinois, United States. It was incorporated as a village on 19 March 1996. At the 2010 census, the population was at 537.", "Union village, Illinois": "Union is a village in McHenry County, Illinois, United States. The population was 580 at the 2010 census, up from 576 in 2000.", "University Park village, Illinois": "University Park is a village in Cook and Will counties in the U.S. state of Illinois. Located almost entirely in Will County, University Park has been the home of Governors State University since 1969. The village population was 7,129 at the 2010 census.<br /><br />The village, one of the region's few planned communities, was known as Wood Hill, Park Forest South, and finally University Park.", "Vernon Hills village, Illinois": "Vernon Hills is a village in Lake County, Illinois, United States, and an affluent northern suburb of Chicago. The population was 20,120 at the 2000 census, and 25,113 in 2010. Vernon Hills serves as a retail hub for its surrounding area (Libertyville, Lake Forest, Long Grove, Lincolnshire and Buffalo Grove).", "Villa Park village, Illinois": "Villa Park is a village in DuPage County, Illinois, United States, within the Chicago metropolitan area. The population was 22,075 at the 2000 census.", "Virgil village, Illinois": "Virgil is a village in Virgil Township, Kane County, Illinois, United States. It was incorporated as a village on November 6, 1990. The population was 329 at the 2010 census, up from 266 in 2000.", "Volo village, Illinois": "Volo is a village in Lake County, Illinois, United States. It was incorporated as a village on 26 April 1993. The population was 2,929 at the 2010 census, up from just 180 in 2000.", "Wadsworth village, Illinois": "Wadsworth is a village in Lake County, Illinois, United States. The population was 3,815 at the 2010 census. It is named after E. S. Wadsworth, who was a major stockholder for the Chicago, Milwaukee, St. Paul and Pacific Railroad, which passes through the village.", "Warrenville city, Illinois": "Warrenville is a city in DuPage County, Illinois, United States. As of the 2010 census, the city had a total population of 13,140, which was estimated to have increased to 13,316 by July 2012. It is a part of the Chicago metropolitan area and the Illinois Technology and Research Corridor.", "Wauconda village, Illinois": "Wauconda (/ˌwɔːˈkɒndə/ or /wəˈkɒndə/) is a village in Lake County, Illinois, United States. The population was 13,603 at the 2010 census. It is the site of the Wauconda Bog Nature Preserve, a National Natural Landmark. Wauconda Community Unit School District 118 serves students from kindergarten through 12th grade who live in Wauconda and surrounding communities (Island Lake, Lakemoor, Volo, and unincorporated sections of McHenry County). Fremont School District 79 also serves students from communities from northern part of Wauconda.", "Waukegan city, Illinois": "Waukegan /wɔːˈkiːɡən/ is a city and the county seat of Lake County, Illinois, United States. It is part of the Chicago Metropolitan Area. As of the 2013 census estimate, the city had a population of 88,826. It is the ninth-largest city in Illinois by population. It is the fifth-largest city on the western shore of Lake Michigan, after Chicago, Milwaukee, Green Bay, and Kenosha.", "Wayne village, Illinois": "Wayne is a village in DuPage and Kane counties, Illinois, United States. The eastern portion, in DuPage County, is in Wayne Township, while the western portion, in Kane County, is in St. Charles Township. The population was 2,431 at the 2010 census. with over 70% of families reporting income over $100,000 in census figures.<br /><br />In the late 19th and early 20th century, Wayne was a prominent center of horse breeding and farming research. The community was known for breeding French Percheron horses, a draught horse similar to a Clydesdale.", "West Chicago city, Illinois": "West Chicago is a city in DuPage County, Illinois, United States. The population was 27,086 at the 2010 census. It was formerly named Junction and later Turner, after its founder, John B. Turner, president of the Galena and Chicago Union Railroad (G&CU) in 1855. The city was initially established around the first junction of railroad lines in Illinois, and today is still served by the Union Pacific West Metra service via West Chicago station.", "West Dundee village, Illinois": "West Dundee is a village in Kane County, Illinois, United States. The population was 7,331 as of the 2010 US Census. It is considered a far west Chicago suburb.<br /><br />West Dundee lies across the Fox River from East Dundee and Carpentersville.", "Westchester village, Illinois": "Westchester is a village in Cook County, Illinois, United States. It is a western suburb of Chicago. The population was 16,718 at the 2010 census. The current Village President is Sam D. Pulia.", "Western Springs village, Illinois": "Western Springs is a village located in Cook County, Illinois, United States and is a suburb of Chicago. As of the 2010 census, the village had a total population of 12,975. It is twinned with Rugeley, United Kingdom.<br /><br />In November, 2007, BusinessWeek.com listed Western Springs second in a list of the 50 best places to raise children. The rankings were based on five factors, including school test scores, cost of living, recreational and cultural activities, number of schools and risk of crime. Western Springs ranked behind Groesbeck, Ohio.", "Westmont village, Illinois": "Westmont is a village in DuPage County, Illinois, United States. Westmont is a community of 5.03 square miles in area. Westmont had a 2000 population of 24,554, a partial special census was conducted 2007 resulting in a population of 26,211, and the census of 2010 put the population at 24,685. It is located approximately 18 miles (29 km) west of the Chicago Loop in the southeastern portion of DuPage County.", "Wheaton city, Illinois": "Wheaton is a suburban city in Milton and Winfield Townships and is the county seat of DuPage County, Illinois, United States. It is located approximately 30 miles (48 km) west of Chicago which abuts the shore of Lake Michigan. As of the 2010 census, the city had a total population of 52,894, which was estimated to have increased to 53,469 by July 2012.", "Wheeling village, Illinois": "Wheeling is a village in Cook and Lake counties in the U.S. state of Illinois. A suburb of Chicago, it is primarily in Cook County. The population was 37,648 at the 2010 census. Wheeling is named for Wheeling, WV.", "Willow Springs village, Illinois": "Willow Springs is a village in DuPage County, Illinois, with portions in Cook County. The village was founded in 1892. The population was 5,524 at the 2010 census.", "Willowbrook village, Illinois": "Willowbook is the name of some places in the U.S. state of Illinois:<br /><br />Willowbrook, DuPage County, Illinois<br /><br />Willowbrook, Will County, Illinois", "Wilmette village, Illinois": "Wilmette is a village in New Trier Township, Cook County, Illinois, United States. It is located 14 miles (23 km) north of Chicago's downtown district (4 mi or 6 km from Chicago's northern border) and had a population at the 2010 census of 27,087. Wilmette is considered a bedroom community in the North Shore region. In 2007, Wilmette was ranked as the seventh best place to raise children in the U.S., according to Business Week. In 2015, Wilmette was ranked the best place to live in Illinois based on a variety of factors including its low unemployment rate, median income, low housing vacancy rate, high education expenditures per student, low crime, and short commute times. In 2016, the personal finance website WalletHub.com published its finding that the residents of Wilmette had an average credit score of 743, ranking it in first place among communities within the State of Illinois.", "Wilmington city, Illinois": "Wilmington is the name of two places in the U.S. state of Illinois:<br /><br />Wilmington, Greene County, Illinois<br /><br />Wilmington, Will County, Illinois", "Winfield village, Illinois": "Winfield is an incorporated village located in Milton and Winfield Townships, DuPage County, Illinois, United States. The population was 8,718 at the 2000 census and as of 2016 the population was 9,492.<br /><br />Winfield is home to Central DuPage Hospital, one of the largest hospitals in the Chicago suburbs. Winfield has a Metra station on the Union Pacific/West Line, which provides regular commuter rail service to Chicago. Attractions adjacent to Winfield include the Forest Preserve District of DuPage County's Kline Creek Farm, a living history farm located on the west side of County Farm Road between Geneva and St. Charles Roads; and Cantigny, which includes public gardens, museums, golf courses, picnic grounds and hiking trails. Cantigny is located on the east side of Winfield Road, just south of Illinois Route 38, also known as Roosevelt Road. Winfield also enjoys parks and recreational services provided by the Winfield Park District. The Forest Preserve District of DuPage County also owns and operates several other open space areas surrounding Winfield. Winfield is considered to be within the top ten safest towns in Illinois.", "Winnetka village, Illinois": "Winnetka (/wᵻˈnɛtkə/) is a village in Cook County, Illinois, United States, located 16 miles north of downtown Chicago. The population was 12,187 at the 2010 census. In 2015, Winnetka was ranked the richest municipality in Illinois and the second richest in the United States (behind Scarsdale, New York). The area is one of the most exclusive and wealthy suburbs in the nation.", "Winthrop Harbor village, Illinois": "Winthrop Harbor is a village in Lake County, Illinois, United States. The population was 6,742 at the 2010 census. It is located along the northern border of Illinois and is part of the Chicago metropolitan area. Winthrop Harbor is known for its North Point Marina, and is a warning demarcation point for the National Weather Service's marine warnings for Lake Michigan. With moorage over 1,500 boats, it is the largest marina on the Great Lakes. Nearly one million visitors take advantage of the marina, its associated beaches and other recreational facilities every summer.", "Wonder Lake village, Illinois": "Wonder Lake is a village in McHenry County, Illinois, United States. The population was 1,345 at the 2000 census, but by the 2010 census, the population had grown to 4,026.", "Wood Dale city, Illinois": "Wood Dale is a city in Addison Township, DuPage County, Illinois, United States. The population was 13,770 at the 2010 census, and estimated to have increased to 13,911, as of July 2012.<br /><br />As part of the Sister Cities International program, a nonprofit citizen diplomacy network that creates and strengthens partnerships between U.S. and international communities, the City of Wood Dale, Illinois has reached out to the city of Cefalù, Italy on the northern coast of the island of Sicily, to establish a long term cultural, educational and business partnership between the two municipalities.", "Woodridge village, Illinois": "Woodridge is a village in Cook, DuPage, and Will counties in the U.S. state of Illinois, and a suburb of Chicago. It uses the 630 and 331 area codes. The population was 32,971 at the 2010 census. Woodridge is the home of the Home Run Inn pizzeria chain and Pabst Brewing Company.<br /><br />Woodridge was incorporated on August 24, 1959, with less than 500 residents, on a wooded area of high ground overlooking the DuPage River's East Branch. Woodridge is a young community with the vast majority of its homes, businesses, and churches constructed after the 1950s. Woodridge was founded by a housing developer, Albert Kaufman, who was largely responsible for the creation of the village.<br /><br />In July 2007, Woodridge was ranked No. 61 on Money magazine's \"100 Best Places to Live\".", "Woodstock city, Illinois": "Woodstock is a city in and the county seat of McHenry County, Illinois, United States, located 51 miles (82 km) northwest of Chicago. The population was 25,528 at the start of 2017. The city's downtown includes a historic, turn-of-the-century town square, which is anchored by the landmark Woodstock Opera House and the Old McHenry County Courthouse. The city was named one of the nation's Dozen Distinctive Destinations in 2007 by the National Trust for Historic Preservation.", "Worth village, Illinois": "Worth is a village in Cook County, Illinois, United States, a suburb of Chicago. The population was 10,789 at the 2010 census.", "Zion city, Illinois": "Zion is a city in Lake County, Illinois, United States. The population was 22,866 at the 2000 census, and had grown to 24,413 as of 2010. The city was founded in July 1901 by John Alexander Dowie. He also started the Zion Tabernacle of the Christian Catholic Apostolic Church, which was the only church in town. It was built in the early 1900s and burned down in 1937. The city was named after Mount Zion, Israel.", "DOUGLAS": "Douglas, on the South Side of Chicago, Illinois, is one of 77 Chicago community areas. The neighborhood is named for Stephen A. Douglas, an Illinois politician, whose estate included a tract of land given to the federal government. This tract later was developed for use as the Civil War Union training and prison camp, Camp Douglas, located in what is now the eastern portion of the Douglas neighborhood. Douglas gave that part of his estate at Cottage Grove and 35th to the Old University of Chicago. The Chicago 2016 Olympic bid planned for the Olympic Village to be constructed on a 37-acre (150,000 m2) truck parking lot south of McCormick Place that is mostly in the Douglas community area and partly in the Near South Side.<br /><br />The Douglas community area stretches from 26th Street South to Pershing Road along the Lake Shore, including parts of the Green Line along State Street and the Metra Electric and Amtrak passenger railroad tracks, which run parallel to Lake Shore Drive. Burnham Park runs along its shoreline, containing 31st Street Beach. The community area also contains part of the neighborhood of Bronzeville, the historic center of African-American culture in the city since the early 20th century and the Great Migration.", "OAKLAND": "For other places with the same name, see Oakland.<br /><br />Oakland, located on the South Side of Chicago, Illinois, USA, is one of 77 officially designated Chicago community areas. Some of Chicago's great old homes may be seen on Drexel Boulevard. Nineteenth-century women's rights and Jewish activist Hannah Greenebaum lived in Oakland. The late 19th-century Monument Baptist Church on Oakwood Blvd. is modeled after Boston's Trinity Church. Oakwood /41st Street Beach in Burnham Park is at 4100 S. Lake Shore Drive.", "FULLER PARK": "Fuller Park, located on the south side of Chicago, Illinois, is one of 77 officially designated Chicago community areas. It is designated Community Area 37.<br /><br />Fuller Park is named for the small park within the neighborhood, which is in turn named for Melville Weston Fuller, a Chicago attorney who was the Chief Justice of the United States between 1888 and 1910.", "GRAND BOULEVARD": "Grand Boulevard, located on the South Side of Chicago, Illinois, is one of the well-defined Chicago Community Areas. The boulevard from which the community area takes its name now bears the name of Martin Luther King, Jr. Drive. The area is bounded by 39th to the north, 51st Street to the south, Cottage Grove Avenue to the east, and the Chicago, Rock Island & Pacific Railroad tracks to the west. The Robert Taylor Homes were located mostly in Grand Boulevard.<br /><br />This is one of the two community areas that encompass the Bronzeville neighborhood, with the other being Douglas. Grand Boulevard also includes the Washington Park Court District neighborhood that was declared a Chicago Landmark on October 2, 1991.<br /><br />The Harold Washington Cultural Center is one of its newer and more famous buildings. Among the other notable properties in this neighborhood are Daniel Hale Williams House, Robert S. Abbott House and Oscar Stanton De Priest House<br /><br />A majority of Grand Boulevard's public transportation needs are met by the Chicago Transit Authority, which provides resident and visitor access to the Green Line services of the Chicago Elevated railway rapid transit, at Indiana, 43rd, 47th and 51st.", "KENWOOD": "Kenwood, one of Chicago's 77 community areas, is on the shore of Lake Michigan on the South Side of the city. Its boundaries are 43rd Street, 51st Street, Cottage Grove Avenue, and the lake. Kenwood was originally part of Hyde Park Township, which was annexed to the city of Chicago in 1889. Kenwood was once one of Chicago's most affluent neighborhoods, and it still has some of the largest single-family homes in the city. It contains two Chicago Landmark districts, Kenwood and North Kenwood. A large part of the southern half of the community area is in the Hyde Park-Kenwood Historic District. In recent years, Kenwood has received national attention as the home of U.S. President Barack Obama.", "LINCOLN SQUARE": "Lincoln Square, located on the North Side of the city of Chicago, Illinois, is one of 77 well-defined Chicago community areas. Greater Lincoln Square encompasses the smaller neighborhoods of Ravenswood Gardens, Ravenswood, Bowmanville, Budlong Woods and Lincoln Square (neighborhood). Although it is sometimes known by these other names the City of Chicago officially designated it as Lincoln Square in 1925.", "WASHINGTON PARK": "Washington Park, Chicago may refer to:<br /><br />Washington Park, Chicago (Community area), a City of Chicago community area<br /><br />Washington Park (Chicago park), a Public City Park in the above community area<br /><br />Washington Park Race Track, a historic horse racing track once located 1 block south of the above park<br /><br />Washington Park Subdivision, a historic subdivision on the site of the former race track", "HYDE PARK": "Hyde Park is a neighborhood and community area on the South Side of Chicago, Illinois, U.S.A. It is located on the shore of Lake Michigan seven miles (11 km) south of the Chicago Loop.<br /><br />Hyde Park's official boundaries are 51st Street/Hyde Park Boulevard on the north, the Midway Plaisance (between 59th and 60th streets) on the south, Washington Park on the west, and Lake Michigan on the east. According to another definition, a section to the north between 47th Street and 51st Street/Hyde Park Boulevard is also included as part of Hyde Park, although this area is officially the southern part of the Kenwood community area. The area encompassing Hyde Park and the southern part of Kenwood is sometimes referred to as Hyde Park-Kenwood.<br /><br />Hyde Park hosts the University of Chicago, the Museum of Science and Industry, and two of Chicago's four historic sites listed in the original 1966 National Register of Historic Places (Chicago Pile-1, the world's first artificial nuclear reactor and Robie House). In the early 21st century, Hyde Park received national attention for its association with U.S. President Barack Obama.", "WOODLAWN": "Woodlawn, on the South Side of Chicago, Illinois, is one of Chicago's 77 community areas. It is bounded by Lake Michigan to the east, 60th Street to the north, Martin Luther King Drive to the west, and 67th Street to the south. Both Hyde Park Career Academy and the all-boys Catholic Mount Carmel High School are in this neighborhood; much of its eastern portion is occupied by Jackson Park. The Woodlawn section of the park includes the site of the planned Obama Presidential Library, an estimated $500 Million Investment. The northern edge of Woodlawn contains a portion of the campus of the University of Chicago.", "ROGERS PARK": "For Rogers Park in Tampa, Florida see Rogers Park, Tampa<br /><br />Rogers Park is one of the 77 Chicago community areas on the far north side of Chicago, Cook County, Illinois and is also the name of the Chicago neighborhood that constitutes most of the community area. Rogers Park is located nine miles north of the Cook County Courthouse in downtown Chicago. It is bounded by the city of Evanston along Juneway Terrace and Howard Street to the north, Ridge Boulevard to the west, Devon Avenue and the Edgewater neighborhood to the south, and Lake Michigan to the east. The neighborhood just to the west, West Ridge, was part of Rogers Park until the 1890s.", "JEFFERSON PARK": "Jefferson Park is one of the 77 community areas of Chicago, located on the Northwest Side of the city. The neighborhood of Jefferson Park occupies a larger swath of territory, as shown on this map.<br /><br />Jefferson Park is bordered by the community areas of Norwood Park to the northwest, Forest Glen to the northeast, Portage Park to the south, and the suburb of Harwood Heights to the south. Although the official community area map draws the boundary between Jefferson Park and Portage Park at Gunnison Street and Lawrence Avenue, the Jefferson Park neighborhood extends to Montrose Avenue farther south.<br /><br /><br /><br />", "FOREST GLEN": "Forest Glen is one of the 77 official city community areas of Chicago, Illinois, located on the city's Northwest Side. It comprises the neighborhoods of Forest Glen, Edgebrook and Sauganash, with sub-neighborhoods of Sauganash Park, Wildwood, North Edgebrook and Old Edgebrook.", "NORTH PARK": "North Park is one of 77 well-defined community areas of the City of Chicago. It is bordered by the North Shore Channel on the east, the Chicago River's North Branch and Foster Avenue on the south, Cicero Avenue on the west (except for the section in the northwest corner, north of Bryn Mawr Avenue, which is part of the Sauganash neighborhood) and Devon Avenue on the north.", "ALBANY PARK": "Albany Park is one of 77 well-defined Chicago, Illinois, community areas on the Northwest Side of the City of Chicago. It includes the Albany Park neighborhood, one of the most ethnically diverse in the United States. It has one of highest percentages of foreign-born residents of neighborhoods in Chicago.<br /><br />Although the majority of those foreign-born residents are from Latin America, the majority from Mexico (especially from the state of Michoacán) and Guatemala, substantial numbers are from the Philippines, India, Korea, Cambodia, Somalia, the Former Yugoslavia (Serbia, Croatia, Bosnia), Romania, Pakistan and the Middle East (especially Iraq, Iran, and Lebanon). Over 40 different languages are spoken in its public schools.<br /><br />Due to the diverse population and immigrant population attraction, the population of the neighborhood increased by 16.5% during the 1990s. It is part of the 60625 ZIP code, which is known as one of the most diverse areas in the entire country.", "PORTAGE PARK": "Portage Park is located on the northwest side of the City of Chicago, Illinois and is one of 77 officially designated Chicago community areas. Portage Park is bordered by the community areas of Jefferson Park and Forest Glen to the north, Dunning and the suburb of Harwood Heights to the west, Irving Park to the east and Belmont-Cragin to the south.<br /><br />The area is notable for its Six Corners outdoor shopping district, centered at the intersection of Irving Park Road, Cicero Avenue and the diagonal Milwaukee Avenue, the Portage Theater and for its namesake - Portage Park. The name of the park was taken from the major portage linking the Des Plaines and Chicago rivers along what is today Irving Park Road. The area was so swampy that in wet weather, Native Americans and trappers were easily able to paddle through the area in either direction without leaving their canoes. In those days, the Des Plaines was perhaps the most significant way to the Illinois, and then on to the Mississippi (and to return).<br /><br />Portage Park has the largest Polish community in the Chicago Metropolitan Area according to the 2000 census. Portage Park is home to the Polish American Association, the Polish Jesuit Millennium Center, the Polish Army Veterans Association in the beautiful building of the former Irving State bank, in addition to the multitude of Polish shops and businesses throughout the district. One of the area's parks is named Chopin Park after Frédéric Chopin, Poland's most famous pianist and composer.", "IRVING PARK": "Irving Park is one of 77 officially designated Chicago community areas located on the Northwest Side. It is bounded by the Chicago River on the east, the Milwaukee Road railroad tracks on the west, Addison Street on the south and Montrose Avenue on the north, west of Pulaski Road stretching to encompass the region between Belmont Avenue on the south and, roughly, Leland Avenue on the north. It is named after the American author Washington Irving.<br /><br />Old Irving Park, bounded by Montrose Avenue, Pulaski Road, Addison Street and Cicero Avenue, has a variety of housing stock, with Queen Anne, Victorian, and Italianate homes, a few farmhouses and numerous bungalows.<br /><br />The CTA Blue Line runs through this neighborhood, with stops at Addison, Irving Park, and Montrose.", "DUNNING": "Dunning is one of 77 officially designated community areas of the city of Chicago, Illinois. Dunning also is a neighborhood located on the Northwest Side of the city.<br /><br />The neighborhood is home to Wilbur Wright College and the Eli's Cheesecake factory.<br /><br />It is also the location of the Chicago-Read Mental Health Center, formerly known as Cook County Insane Asylum and commonly referred to, in its day, as simply \"Dunning.\"", "MONTCLARE": "Montclare is one of 77 officially designated Chicago community areas located on the Northwest Side of the City of Chicago, Illinois. It is served by Metra's Milwaukee District/West Line via Mont Clare station.", "BELMONT CRAGIN": "Belmont Cragin is one of 77 officially designated Chicago community areas located on the Northwest Side of the City of Chicago, Illinois. It is designated Community Area 19, and is located 8 miles (13 km) NW of the Loop.", "WEST RIDGE": "West Ridge is one of 77 Chicago community areas. It is a middle-class neighborhood located on the far North Side of the City of Chicago. It is located in the 50th Ward. Also historically called North Town, and frequently referred to as West Rogers Park, it is bordered on the north by Howard Street, on the east by Ridge Boulevard, Western Avenue, and Ravenswood Avenue, the south by Bryn Mawr Avenue and Peterson Avenue, and on the west by Kedzie Avenue and the North Shore channel of the Chicago River. At one time joined with neighboring Rogers Park, it seceded to become its own village in 1890 over a conflict concerning park districts (known as the Cabbage War). West Ridge was annexed to Chicago on April 4, 1893, along with Rogers Park.<br /><br /><br /><br />Today West Ridge is one of Chicago's better off communities, filled with thriving multi-ethnic culture lining Devon Avenue, historic mansions lining Ridge and Lunt Avenues, cultural institutions such as St. Scholastica Academy and one of the highest per capita incomes on the North Side of Chicago. It had been represented in the Chicago City Council by Alderman Bernard Stone from 1973 until May 2011. On April 5, 2011, Alderman Debra Silverstein defeated Stone in a runoff election and now represents the 50th Ward, which encompasses West Ridge.<br /><br />It is home to the Midwest's largest Hasidic community, as well as other Jewish, Irish American, German-American, Indian, Pakistani, Bangladeshi, Assyrian, Russian, and Korean immigrant communities.", "HERMOSA": "Hermosa is one of 77 designated Chicago community areas and is located on the northwest side of Chicago, Illinois. The Hermosa community area contains the Kelvyn Park and Hermosa neighborhoods. The area includes the birthplace of Walt Disney and is the former headquarters of the Schwinn Bicycle Company. While being one of the smaller community areas Hermosa is one of the city’s most densely populated neighborhoods.<br /><br />Today, Hermosa is a predominantly Hispanic blue collar community, with a sizable manufacturing base. Many of the people who reside in Hermosa have done so because of its convenient location to work, its relative proximity to downtown, and because of its healthy public transportation options. The Consulate-General of Honduras in Chicago is located in Hermosa at 4439 West Fullerton Avenue.", "AVONDALE": "Avondale (/ˈævəndeɪl/) is one of 77 officially designated Chicago, Illinois community areas. It is located on the Northwest Side of Chicago. Its main borders are the North Branch of the Chicago River, Diversey Avenue, Addison Street, Pulaski Road and the Union Pacific/Northwest rail line; bisecting the community are Belmont and Milwaukee Avenues along with the Kennedy Expressway (Interstate 90/Interstate 94).", "LOGAN SQUARE": "Logan Square is an official community area, historical neighborhood, and public square located on the northwest side of the City of Chicago. The Logan Square community area is one of the 77 city-designated community areas established for planning purposes. The Logan Square neighborhood, located within the Logan Square community area, is centered on the public square that serves as its namesake, located at the three-way intersection of Milwaukee Avenue, Logan Boulevard and Kedzie Boulevard.<br /><br />The community area of Logan Square is, in general, bounded by the Metra/Milwaukee District North Line railroad on the west, the North Branch of the Chicago River on the east, Diversey Parkway, on the north, and Bloomingdale Avenue on the south. The area is characterized by the prominent historical boulevards, stately greystones and large bungalow-style homes.", "HUMBOLDT PARK": "Humboldt Park, one of 77 designated community areas, is on the West Side of Chicago, Illinois. The Humboldt Park neighborhood is known for its dynamic social and ethnic demographic change over the years. The Puerto Rican community has identified strongly with the area since the 1970s; Humboldt Park is also the name of a 207-acre (0.8 km²) park adjacent to the community area.", "WEST TOWN": "West Town, located in Chicago, in the U.S. state of Illinois, northwest of the Loop, on Chicago's West Side is one of 77 officially designated Chicago community areas. Much of this area was historically part of the city's Polish Downtown, and its name may refer to Western Avenue, which was the city's western boundary at the time of West Town's settlement, but more likely was a convenient abstraction by the creators of Chicago's community areas. Then, as now, West Town was a collection of several distinct neighborhoods. The boundaries of the community area are the Chicago River to the east, the Union Pacific railroad tracks to the south, the former railroad tracks on Bloomingdale Avenue to the North, and an irregular western border to the west that includes the city park called Humboldt Park. Humboldt Park is also the name of the community area to West Town's west, Logan Square is to the north, Near North Side to the east, and Near West Side to the south. Currently, as well as historically, the collection of neighborhoods in West Town along with the neighborhoods of Bucktown and the eastern portion of Logan Square have been referred to by media as the Near Northwest Side. However, since the gentrification of West Town, media often refer to the area as solely the Northwest Side, most likely to separate it from the image of criminality in the West Side and downtown for the purposes of real estate gentrification tactics.", "AUSTIN": "Austin, is one of seventy-seven officially designated community areas in Chicago. It the currently the largest community area both geographically and by population. Austin's eastern boundary is the Belt Railway located just east of Cicero Avenue. Its northernmost border is the Milwaukee District / West Line. Its southernmost border is at Roosevelt Road from the Belt Railway west to Austin Boulevard. The northernmost portion, north of North Avenue, extends west to Harlem Avenue, abutting Elmwood Park. In addition to Elmwood Park, Austin also borders the suburbs of Cicero and Oak Park.", "WEST GARFIELD PARK": "West Garfield Park located on the West Side of Chicago, Illinois, is one of 77 officially designated Chicago community areas. It is situated directly west of Garfield Park (Chicago).", "EAST GARFIELD PARK": "East Garfield Park is a community area on the West Side of Chicago, Illinois, west of the Loop.<br /><br />Taking its name from the large urban park, Garfield Park, the neighborhood is bordered by Franklin Boulevard on the north, Arthington and Taylor Streets on the south, Hamlin Avenue and Independence Boulevard to the west, and Rockwell Street to the east.<br /><br /><br /><br />", "NEAR WEST SIDE": "The Near West Side , one of the 77 community areas of Chicago, is on the West Side, west of the Chicago River and adjacent to the Loop. The history of the Near West Side of Chicago includes the founding of Hull House, a prominent settlement house. The Great Chicago Fire started in the Near West Side. The area is home to the University of Illinois at Chicago (UIC), the United Center and the Illinois Medical District.", "NORTH LAWNDALE": "North Lawndale (also known simply as \"Lawndale\") located on the West Side of Chicago, Illinois, is one of the well-defined community areas in the city of Chicago.", "UPTOWN": "Uptown is one of Chicago’s 77 community areas. Uptown's boundaries are Foster Avenue on the north; Lake Michigan on the east; Montrose (Ravenswood to Clark), and Irving Park (Clark Street to Lake Michigan) on the south; Ravenswood (Foster to Montrose), and Clark (Montrose to Irving Park) on the west. To the north is Edgewater, to the west is Lincoln Square, and to the south is Lake View.", "SOUTH LAWNDALE": "South Lawndale, one of Chicago's 77 well-defined community areas, is on the West Side of the city of Chicago, Illinois.", "LOWER WEST SIDE": "Lower West Side is a community area on the West Side of Chicago, Illinois, United States. It is three miles southwest of the Chicago Loop, and its main neighborhood is Pilsen. The Heart of Chicago is a neighborhood in the southwest corner of the Lower West Side.", "NEAR SOUTH SIDE": "The Near South Side is a community area of Chicago in Cook County, Illinois, United States. It is located just south of the downtown central business district, the Loop, which is itself a community area. The Near South Side's boundaries (see map) are as follows: North—Roosevelt Road (1200 S); South—26th Street; West—Chicago River between Roosevelt and 18th Street, Clark Street between 18th Street and Cermak Road, Federal between Cermak Road and the Stevenson Expressway just south of 25th Street, and Clark Street again between the Stevenson and 26th Street; and East—Lake Michigan.<br /><br />The portion of the Near South Side located near Lake Shore Drive contains some of the most well-known structures in Chicago: Soldier Field, the home of the National Football League Chicago Bears; McCormick Place, Chicago's primary convention center; the Museum Campus, which contains the Field Museum, the Shedd Aquarium, and the Adler Planetarium; and Northerly Island. The remaining area is currently undergoing a major residential and mixed-use redevelopment. As part of the Chicago 2016 Olympic bid, the Olympic Village was planned to be located on a 37-acre (150,000 m2) truck parking lot south of McCormick Place that is mostly in the Douglas community area and partly in the Near South Side.", "ARMOUR SQUARE": "Armour Square is a Chicago neighborhood on the city's South Side, as well as a larger, officially defined community area which also includes Chinatown and the CHA Wentworth Gardens housing project. Armour Square is bordered by Bridgeport to the west and Bronzeville to the east, with Pilsen and the near South Side bordering the area to the north and Fuller Park bordering its southernmost boundary along Pershing Road.", "NORWOOD PARK": "Norwood Park is one of 77 Chicago community areas. It encompasses the smaller neighborhoods of Big Oaks, Norwood Park East, Norwood Park West, Old Norwood Park, Oriole Park, and Union Ridge.<br /><br />Originally organized in 1872 from adjacent townships (Jefferson, Leyden and Niles) as a village, and named after Henry Ward Beecher's novel Norwood, or Village Life in New England (1868), Norwood Park was annexed to the City of Chicago in 1893. Norwood Park was incorporated as a village in 1874 and annexed to Chicago on November 7, 1893.<br /><br />Every Memorial Day there is a parade that runs through Norwood Park. The parade has been a local tradition for more than 90 years, starting in 1922. The community area also boasts the oldest extant building in Chicago, the Noble-Seymour-Crippen House. Taft High School was completed in 1939, with major additions made in 1959 and 1974.", "NEAR NORTH SIDE": "The Near North Side is one of 77 defined community areas of Chicago, Illinois, United States. It is the northernmost of the four areas that constitute Downtown Chicago, the others being the Near West Side, Near South Side, and the Loop. The community area is located north and east of the Chicago River. To its east is Lake Michigan, and its northern boundary is the 19th-century city limit of Chicago, North Avenue. Of the downtown community areas, the Near North Side has the second largest total area, after the Near West Side, the highest number of skyscrapers, and the largest population. With the exception of Goose Island and the remnants of Cabrini–Green, to the west, the Near North Side is known for its extreme affluence, typified by the Magnificent Mile, Gold Coast, Navy Pier, and its world-famous skyscrapers.<br /><br />The Near North Side is the oldest part of Chicago. In the 1780s, in what is now the Near North Side, on the northern banks of the Chicago River near today's Michigan Avenue Bridge, Jean Baptiste Point du Sable built the first known permanent settlement in \"Eschecagou.\" Today this is marked by Pioneer Court.<br /><br />Especially in the vicinity of Rush and Erie streets, the Near North Side was once known as McCormickville; so named because it is here where many branches of the famous McCormick family of mechanical reaper fame built their mansions in the late 19th and early 20th centuries.", "LOOP": "", "SOUTH SHORE": "South Shore is one of 77 defined community areas of Chicago, Illinois, United States. A predominantly African American neighborhood on the city's South Side, the area is named for its location along the city's southern lakefront. Although South Shore has seen a greater than 40% decrease in residents since Chicago's population peaked in the 1950s, the area remains is one of the most densely populated neighborhoods on the South Side. The community benefits from its location along the waterfront, its accessibility to Lake Shore Drive, and its proximity to major institutions and attractions such as the University of Chicago, the Museum of Science and Industry, and Jackson Park.", "CHATHAM": "Chatham is one of the 77 community areas of the city of Chicago, Illinois. It is located on the city's South Side. It includes the neighborhoods of Chatham, East Chatham, West Chatham and the northern portion of West Chesterfield. Its residents are predominantly African American, and it is home to former Senator Roland Burris. Housing many city employees and other officials, Chatham has been a central area for Chicago's middle-class African Americans since the late 1950s.", "AVALON PARK": "Avalon Park, located on the south side of the U.S. city of Chicago, Illinois, is one of the city's 77 official community areas and a park. Boundaries are 76th St. to the north, South Chicago Ave. to the east and 87th St. to the south. The community area includes the neighborhoods of Avalon Park, Marynook and Stony Island Park.", "SOUTH CHICAGO": "South Chicago, formerly known as Ainsworth, is one of the 77 well-defined community areas of Chicago, Illinois.<br /><br />This chevron-shaped community is one of Chicago's 16 lakefront neighborhoods near the southern rim of Lake Michigan 10 miles south of downtown. A working-class neighborhood, it is bordered by East 79th Street on the north, South Chicago Avenue (the Chicago Skyway) on the southwest, a small stretch of East 95th Street on the south. With the Calumet River on the community's southeast side, South Chicago can be considered the literal gateway to the Calumet Region and the first among the four Chicago neighborhoods (East Side, Hegewisch and South Deering) that are considered by the locals as Chicago's Southeast Side. Particularly unknown because most of its streets run off the citywide grid, it also encompasses the unique Alphabet Avenues. The Southeast Side is a description that, although true, the city itself continues to resist including this neighborhood with all of Chicago's South Side communities.", "BURNSIDE": "Burnside is one of the 77 official community areas of Chicago, Illinois, and is located on the city's south side. This area is also called by locals, \"The Triangle\", as it is bordered by railroad tracks on every side; the Illinois Central on the west, the Rock Island on the south and the Nickel Plate Railroad (now Norfolk-Southern) on the east.<br /><br />Originally considered part of Roseland and the Chatham communities, it was distinguished as one of the 77 Chicago communities when the University of Chicago established its official map of Chicago communities. The area was mostly undeveloped swamp land north of Lake Calumet until after the American Civil War. The Illinois Central Railroad (ICRR) built the Burnside Station at 95th street and named it after Ambrose Burnside, a Civil War general and official of the ICRR.<br /><br />By the 1890s, the ICRR began construction of a roundhouse and repair shop at 95th and South Park Boulevard on what is now the site of Chicago State University. Developer W. V. Jacobs purchased the land in the triangle and began building residential homes. The area was settled by predominantly Hungarian, Polish, Italian and Ukrainian immigrants. Factory jobs were plentiful at the nearby Burnside Shops as well as Pullman Company, Burnside Steel Mill and other nearby factories.<br /><br />Following World War II, the area's population makeup included a growing number of African-Americans. This was one of several transformations that this working-class neighborhood would undergo. Burnside's fortunes began to change in the 1960s when industry patterns lead to economic decline. Nearby steel mills were shuttered. The Pullman Company scaled back production and eventually closed for good in 1981. Skyrocketing crime rates, gang violence and urban decay forced longtime residents and businesses to move away, a phenomenon referred to as white flight.", "MCKINLEY PARK": "McKinley Park, one of the 77 official community areas of Chicago, Illinois, is located on the city's southwest side.<br /><br />McKinley Park is served by three neighborhood newspapers: the Bridgeport News, the Archer Journal News and the Brighton Park/McKinley Park Life. The neighborhood newspapers are delivered weekly on Wednesdays to homes, businesses and other establishments throughout the neighborhood.", "LAKE VIEW": "Lakeview, is one of the 77 community areas of Chicago, Illinois, located on the city's North Side. It is bordered by West Diversey Parkway on the south, West Irving Park Road on the north, North Ravenswood Avenue on the west, and the shore of Lake Michigan on the east. The Uptown community area is to Lakeview's north, Lincoln Square to its northwest, North Center to its west and Lincoln Park to its south. The 2014 population of Lakeview was 97,968 residents, making it the second largest of the Chicago community areas by population, following Austin which has 98,514 residents. Lakeview, though, has a higher population density than the larger-in-area Austin neighborhood.<br /><br />Lakeview unofficially includes smaller neighborhood enclaves: Sheridan Station Corridor, Boystown, Northhalsted, Southport Corridor, Wrigleyville, & Wrigley Plaza. Boystown, famous for its large LGBT population, holds the pride parade held each June. Wrigleyville, another popular district, surrounds Wrigley Field, home of the Chicago Cubs. Lakeview is home to the Belmont Theater District showcasing over 30 theaters and live performance venues located near the Belmont El station. In 2013 Money Magazine named Lakeview as number 3 of its top 10 Big-city neighborhoods for its selection of Best Places to Live.", "CALUMET HEIGHTS": "Calumet Heights, located on the South Side of the city, is one of the 77 well defined community areas of Chicago, Illinois. Calumet Heights is bounded by 87th Street on the north, South Chicago Avenue on the east, and railroad lines on the west and south (along 95th Street). It includes the neighborhoods of Calumet Heights and Pill Hill. Beginning at about 91st Street and Constance Avenue is the geographical feature for which it was named, a stony hill that was once an island when glacial Lake Chicago covered the area thousands of years ago. Early pioneers gave this hill the name Stony Island because at a distance it looked like an island in set a trackless prairie sea. (See also the nearby Blue Island).<br /><br />Calumet Heights was swampy and relatively unoccupied throughout the nineteenth century. A railroad was built in 1881 along the western border of Calumet Heights leading to the development of the neighborhood.", "ROSELAND": "Roseland, located on the far south side of the city, is one of the 77 official community areas of Chicago, Illinois. It includes the neighborhoods of Fernwood, Princeton Park, Lilydale, the southern portion of West Chesterfield, Rosemoor, Sheldon Heights and West Roseland.", "NORTH CENTER": "North Center is one of the 77 community areas of Chicago, Illinois, located in the city's North Side. North Center is bordered on the north by Montrose Avenue, on the south by Diversey Parkway, on the west by the Chicago River and on the east by Ravenswood Avenue; it includes the neighborhoods of Northcenter, Roscoe Village, St. Ben's, and Hamlin Park. The Brown Line of the Chicago 'L' has stops within the community area at Addison, Irving Park and Montrose.<br /><br />North Center was settled in the latter part of the 19th century and the early 20th century largely by Germans who worked in what is known as the industrial corridor along Ravenswood Avenue, and the large industrial plants along the Chicago River to the west.", "PULLMAN": "Pullman, one of Chicago's 77 defined community areas, is a neighborhood located on the city's South Side. Twelve miles from the Chicago Loop, Pullman is situated adjacent to Lake Calumet.<br /><br />The area known as Pullman encompasses a much wider area than its two historic areas (the older historic area is often referred to as \"Pullman\" and is a Chicago Landmark district and a National Monument. The northern annex historic area is usually referred to as \"North Pullman\"). This article deals with all areas. The development built by the Pullman Company is bounded by 103rd Street on the North, 115th Street on the South, the railroad tracks on the East and Cottage Grove on the West.<br /><br />Since the late 20th century, the Pullman neighborhood has been gentrifying. Many residents are involved in the restoration of their own homes, and projects throughout the district as a whole. Walking tours of Pullman are available.<br /><br />Pullman has many historic and architecturally significant buildings; among these are the Hotel Florence; the Arcade Building, which was destroyed in the 1920s; the Clock Tower and Factory, the complex surrounding Market Square, and Greenstone Church. In the adjacent Kensington neighborhood of the nearby Roseland district is the home of one of the many beautiful churches in Chicago built in Polish Cathedral style, the former church of St. Salomea. It is now used by Salem Baptist Church of Chicago.<br /><br />In a contest sponsored by the Illinois Department of Commerce and Economic Opportunity, Pullman was one of seven sites nominated for the Illinois Seven Wonders.<br /><br />Pullman is served by two Metra Electric Line stations: Kensington (115th Street) and Pullman (111th Street). Most Metra suburban express trains passing through the area stop at the 115th Street station, and only local trains stop at the 111th Street station.", "SOUTH DEERING": "South Deering, is the largest of the 77 official community areas of the City of Chicago, Illinois, is located on the far south side. It was a very industrial neighborhood, consisting of a small group of homes in the northeast corner and Lake Calumet taking up most of the remainder. It exists in the 10th Ward, what was once the reign of Alderman Edward Vrdolyak, now in private law practice. It was the home of the now defunct Wisconsin Steel Works, originally the Joseph H. Brown Iron and Steel Company, which opened in 1875 and was the first steel mill in the entire Calumet region. Since the closing of the plant, the neighborhood has gone through an economic depression.<br /><br />Louis Rosen documented the racial transition of this and nearby communities in his 1998 book The South Side: The Racial Transformation of an American Neighborhood.<br /><br /><br /><br />", "EAST SIDE": "East Side is one of the 77 official community areas of Chicago, Illinois. It is located on the far south side of the city, between the Calumet River and the Illinois-Indiana state line, approximately 13 miles (21 km) south of Downtown Chicago. The neighborhood has its own park on Lake Michigan, Calumet Park, and its own forest preserve, Eggers Grove Forest Preserve, which neighborhood residents usually call Eggers Woods. It is served by U.S. Highway 12, U.S. Highway 20, and U.S. Highway 41, which are multiplexed in this neighborhood.", "WEST PULLMAN": "West Pullman is a neighborhood located on the far south side of the city of Chicago, Illinois. It is one of the 77 official community areas of Chicago. West Pullman is not a part of the historic Pullman company town.<br /><br />It is bounded on the north by 115th Street, on the east by the former Illinois Central Railroad, on the south by the Calumet River and Riverdale, on the west by Calumet Park, Blue Island and Ashland Avenue.<br /><br />A high number of jobs were lost in the 1980s and 1990s making unemployment one of West Pullman's biggest problems. The other is the high amount of toxic waste left behind from the factories. A joint effort from community leaders, residents, city officials and the government is attempting to reduce the levels of toxicity.<br /><br />West Pullman is also home to the largest urban photovoltaic solar plant in the United States. The 10 MW plant utilizes 32,800 SunPower solar panels, spans 39 acres (160,000 m2), and generates enough power to supply energy to approximately 1500 homes in the Midwest. It is owned and operated by Exelon and came online in early 2010.", "RIVERDALE": "Riverdale is one of the 77 official community areas of Chicago, Illinois and is located on the city's far southeast side.<br /><br />As originally designated by the Social Science Research Committee at the University of Chicago and officially adopted by the City of Chicago, the Riverdale community area extends from 115th Street south to the city boundary at 138th Street and from the Illinois Central Railroad tracks east to the Bishop Ford Freeway.", "HEGEWISCH": "Hegewisch (pronounced /ˈhɛɡˌwɪʃ/ \"heg-wish\" by the locals. It derives from a German surname pronounced \"hege-vish\"), one of the 77 community areas of Chicago, Illinois, is located on the city's far south side. It is bordered by the neighborhoods of Riverdale and South Deering to the west, the East Side to the north, the village of Burnham to the south and the city of Hammond, Indiana to the east. The community area is named for Adolph Hegewisch, the president of U.S. Rolling Stock Company who hoped to establish “an ideal workingman's community” when he laid out the town along a rail line in 1883, six years before Chicago annexed the town.", "GARFIELD RIDGE": "Garfield Ridge is one of the 77 official community areas of Chicago, Illinois, and is located on the southwest side of the city. The northern half of Midway International Airport is located in this community area.", "ARCHER HEIGHTS": "Archer Heights is a neighborhood in Chicago, Illinois. One of the 77 official community areas of Chicago.<br /><br />Archer Avenue runs from south of Chicago's downtown area, through the southwest side of Chicago and beyond into the southwest suburbs, along what was once a Native American trail. The neighborhood is bounded by the Stevenson Expressway to the north, the CTA Orange Line to the south, the Corwith railyard to the east, and the railroad tracks/Knox Avenue to the west.", "BRIGHTON PARK": "Brighton Park is a neighborhood located on the southwest side of Chicago, Illinois. It is number 58 of the 77 community areas of Chicago.<br /><br />Brighton Park is bordered on the north by the former Illinois & Michigan Canal and the current Chicago Sanitary and Ship Canal, on the east by Western Avenue, on the south by 49th Street, and on the west by Central Park Ave. <br /><br />The neighborhood is a mix of residential areas, commercial zones, industrial works and transportation (primarily railroad and trucking) facilities. It is relatively peaceful, according to Chicago Police Department statistics (2004 CPD Annual Report).", "BRIDGEPORT": "Bridgeport, one of 77 community areas of Chicago, Illinois, is a neighborhood on the city's South Side, bounded on the north by the South Branch of the Chicago River, on the west by Bubbly Creek, on the south by Pershing Road, and on the east by the Union Pacific railroad tracks. Neighboring community areas are the Lower West Side across the river to the north, McKinley Park to the west, Canaryville to the south, and Armour Square to the east. Bridgeport has been the home of five Chicago mayors. Once known for its racial intolerance, Bridgeport today ranks as one of the city's most diverse neighborhoods.", "NEW CITY": "New City is one of Chicago's 77 official community areas, located on the southwest side of the city in the South Side district. It contains the neighborhoods of Canaryville and Back of the Yards.<br /><br />The area was home to the famous Union Stock Yards that were on Chicago's south side until closed in 1971.", "WEST ELSDON": "West Elsdon, one of the 77 official community areas, is located on the southwest side of the City of Chicago, Illinois. It is noted as a twin neighborhood of West Lawn. It has a population which includes a mix of dwindling Polish-American residents and increasing Mexican-American residents who currently constitute a clear majority. It has its own association, \"West Elsdon Civic Association,\" which privately organizes the neighborhood. St. Turibius grade school, a Roman Catholic elementary school, located at 57th and Karlov, closed in 2013 and is currently inactive though the building remains and is adjacent to St. Turibius Roman Catholic church. The former Lourdes Roman Catholic girls' high school located from 55th to 56th street from Komensky to Karlov Avenue is now a Chicago Public Schools magnet high school, John Hancock High School.", "GAGE PARK": "Gage Park is one of Chicago's 77 well-defined community areas, located on the city's southwest side; it is also the name of a park within the neighborhood. Gage Park's population is largely working-class, and its housing stock is mostly bungalows. For generations, the neighborhood was Eastern European and Irish Catholic. The neighborhood remains overwhelmingly Catholic with the addition of many Hispanic residents.", "CLEARING": "Clearing, one of the 77 official community areas, is located on the southwest side of the city of Chicago, Illinois. The southern portion of Chicago Midway International Airport is located within this community area.", "WEST LAWN": "West Lawn, one of Chicago's 77 official community areas, is located on the southwest side of the city. It is considered to be a \"melting pot\" of sorts, due to its constant change of races moving in and out of the area, as well as the diversity that exists there. It has a small town atmosphere in the big city. West Lawn is home to many Polish-Americans, Irish-Americans, Mexican-Americans, and other people of Latin American and Eastern European origin. The current Alderman of the West Lawn community is Alderman Marty Quinn.", "CHICAGO LAWN": "Chicago Lawn is one of the 77 community areas of Chicago, Illinois. It is located on the southwest side of the city. Its community neighbors include Gage Park, West Englewood, Ashburn, and West Lawn. It is bounded by Bell Avenue on the east, Central Park Avenue on the west, 59th Street on the north, and 75th Street on the south, and is 13 km (8.1 mi) southwest of the Loop. Local citizens refer to the area as \"Marquette Park,\" after the park in its center.<br /><br /><br /><br />", "WEST ENGLEWOOD": "West Englewood, one of the 77 community areas, is on the southwest side of Chicago, Illinois. At one time it was known as South Lynne. The boundaries of West Englewood are Garfield Blvd to the north, Racine Ave to the east, the CSX and Norfolk Southern RR tracks to the west, and the Belt Railway of Chicago to the south. Though it is a separate community area, much of the history and culture of the neighborhood is linked directly to the Englewood neighborhood.", "ENGLEWOOD": "Englewood is one of the 77 official community areas in Chicago, Illinois, United States. At its peak population in 1960, over 97,000 people lived in its approximately 3 square miles (7.8 km2), but the neighborhood's population has since dropped dramatically. In 2000, it had a population of approximately 40,000 inhabitants, and the 2010 census indicated that its population has further declined to approximately 30,000. Englewood is bordered by Garfield Boulevard to the north, 75th Street to the south, Western Avenue to the west, and State Street to the east. It is located on the southwest side of Chicago.", "GREATER GRAND CROSSING": "Greater Grand Crossing, one of the 77 static community areas of Chicago, Illinois, is located on the city's South Side.<br /><br />The name \"Grand Crossing\" comes from an 1853 right-of-way feud between the Lake Shore and Michigan Southern Railway and the Illinois Central Railroad that led to a frog war and a crash that killed 18 people.", "LINCOLN PARK": "Lincoln Park is a designated community area in North Side, Chicago, Illinois.", "ASHBURN": "Ashburn, one of Chicago's 77 community areas, is located on the southwest side of the city. Greater Ashburn covers nearly five square miles. The approximate boundaries of Ashburn are 75th Street (N), Western Avenue (E), 87th Street (S) and Cicero Avenue (W).", "AUBURN GRESHAM": "Auburn Gresham, one of the 77 official community areas, is located on the far south side of the city of Chicago, Illinois. It was the original location of the South Side Irish Parade before it was relocated to the Beverly neighborhood farther southwest in the city.<br /><br />Auburn Gresham's development as a community dates back to the early nineteenth century, when the area was defined primarily by small German and Dutch settlements. A later influx of Irish railroad workers and others lured to the South Side by newly extended city services in the late nineteenth century led to further residential and commercial growth. In the 1920s, the population increased nearly threefold, from 19,558 to 57,381. The plethora of bungalow-style housing and brick two-flat apartment buildings throughout Auburn Gresham serves as lasting evidence of the community's formative years.<br /><br />Auburn Gresham is serviced by a Metra commuter rail stop at W. 87th St. and Vincennes Ave., which provides daily inbound service to LaSalle Street Station in Chicago and outbound service to Joliet. Community leaders have long encouraged the construction of an additional Metra rail stop at W. 79th St. In 2014, the City of Chicago obtained a half-acre parcel of land on which to construct the station. CTA red line stops at 79th St. and 87th St. are also available along the Dan Ryan Expressway in nearby Chatham.<br /><br />Chicago Public Library operates the Thurgood Marshall Branch in Auburn Gresham at W. 75th St. and S. Racine Ave. The 13,500 square foot library, which features a 125-seat auditorium, reading garden, and several artworks, opened in April 1994.<br /><br />St. Sabina Church is located in the community, headed by Rev. Michael Pfleger. The church and its priest have been pivotal in helping transform Auburn Gresham, with new housing and store fronts opening up in the neighborhood. One of the largest new single-family home developments in Chicago is nearly complete at W. 87th St. and S. Parnell Ave., in the southeast corner of Auburn Gresham.<br /><br />Auburn Gresham is home to the St. Leo Campus for Veterans, which includes the Catholic Charities' St. Leo's Residence, the Auburn Gresham Community Based Outpatient Clinic, the St. Leo's Veteran's Garden, and the Pope John Paul II Residence. The community is also home to Perspectives Leadership Academy and Perspectives Technology Academy which are a part of the Renaissance 2010 program. Both schools are housed in the same building that was home to the former Calumet High School (Chicago) in the Auburn Gresham community. Calumet High School (Chicago) was one of Chicago's oldest high schools opening its doors to Auburn Gresham neighborhood students in 1919. The Auburn Gresham community is also home to the first urban S.O.S. Children's Village in the U.S.", "BEVERLY": "Beverly is one of the 77 community areas of Chicago, Illinois. It is located on the South Side on the southwestern edge of the city. The borders are (roughly) 87th Street on the north; Beverly Avenue, Hale Avenue and Vincennes Road on the east; 107th Street on the south; and Francisco Avenue and Western Avenue on the west. A segment of the eastern part of the Ridge Country Club lies with the boundaries of the community. Sparsely settled in the middle of the 19th century, Beverly began to be developed by business interests from Chicago in the latter part of the nineteenth century, encouraged largely by the completion in 1889 of the suburban line of the Rock Island Railroad that runs parallel with the eastern edge of the Blue Island ridge (see the Ulrich & Son ad that appears elsewhere in this article). The natural beauty of its position on the ridge allowed the community to become an exclusive streetcar suburb, and the homes and large lots reflect this historic distinction. Beverly is located on the highest elevation in Chicago, and is one of the most racially and ethnically diverse neighborhoods in the city.", "WASHINGTON HEIGHTS": "Washington Heights, one of the 77 official community areas, is located on the far south side of the city of Chicago, Illinois, loosely bordered in the south by 107th street, the north by 89th street, the west by Beverly Avenue and the East by Eggleston Avenue.<br /><br />Illinois Place Names (Illinois State Historical Society Occasional Publications Number 55, 1989) indicates that the area of Washington Heights historically was also known as Blue Island Ridge, Campbell's Woods, Dummy Junction, and North Blue Island. A Post Office by the name of Washington Heights was established 25 October 1869 and dissolved 6 June 1894. As noted, it is now part of Chicago. It was one of the many small towns and villages that were annexed into the City of Chicago in the late 19th century. At this time, it was predominantly a bedroom community of German and Irish families whose immigration to the Midwestern United States began circa 1880.<br /><br />The landscape of Washington Heights changed beginning in the late 1960s as a result of two factors. The West Leg extension of the Dan Ryan Expressway, more commonly known as Interstate 57, cut through the southern half of the community, dividing the area and displacing several long-time residents. It opened in October 1967. Simultaneously, a growing number of African Americans began moving into the community. Adjacent Auburn Gresham and Roseland also began experiencing white flight during the 1960s in the same way that communities to the north, such as Englewood and Greater Grand Crossing, experienced the decade prior. In the 1970s the demographics of Washington Heights changed primarily to African-American, as it still exists today. The community continues to retain its middle-class character.<br /><br /><br /><br />Washington Heights is serviced by three Metra commuter rail stops, which provide daily inbound service to LaSalle Street Station in Chicago and outbound service to Joliet. A CTA red line stop at 95th St. is also available along the Dan Ryan Expressway in nearby Roseland.<br /><br />Washington Heights has seen redevelopment in recent years. One of the largest single-family home developments in the city, \"The Renaissance at Beverly Ridge,\" is under construction in the southwest corner of Washington Heights at W 105th Street and S Throop Ave on the former Chicago Bridge & Iron Company site. Likewise, a formerly abandoned railroad line that ran along the southwestern edge of the community was acquired by the Chicago Park District and converted into the \"Major Taylor Trail\" in 2007. It runs between the Dan Ryan Woods in Beverly and the Whistler Woods in suburban Riverdale, crossing the Calumet River and Interstate 57.", "MOUNT GREENWOOD": "Mount Greenwood is one of Chicago's 77 community areas. It is a predominantly Irish-Catholic neighborhood on the South Side of the city. It borders the neighborhoods of Beverly and Morgan Park to the east, the suburb of Evergreen Park to the north, the suburb of Oak Lawn to the west, and the suburbs of Merrionette Park and Alsip to the south. Because of the presence of the cemeteries along the eastern edge of the neighborhood, the area was fictitiously said to have been known as \"Seven Holy Tombs\" before it was known as Mount Greenwood by author and playwright, John R. Powers in his fictionalized trilogy about growing up there. Mount Greenwood is about 14 miles (23 km) southwest of the Loop.<br /><br />The origins of Mount Greenwood began in 1879 when the surveyor George Washington Waite (b.1839) platted an eighty-acre land grant that he had received from the federal government. Mount Greenwood Cemetery was established in that year on what had between 1854 and 1869 been the farm of Benjamin Kaylor. The cemetery was developed by businessmen from Blue Island who needed a place to relocate the remains of individuals who had previously been buried in that community's municipal cemetery, which the village board had deemed a public nuisance after its growth had become unmanageable. The cemetery is the final resting-place of Robert Haslam (1840-1912), who as a twenty-year-old immigrant from England became one of the most celebrated riders of the Pony Express mail service that operated from 1860-1861. Although completely surrounded by the City of Chicago, Mount Greenwood Cemetery is not part of Chicago. It is in unincorporated Cook County, Illinois. Mount Greenwood was incorporated as a village in 1907 and annexed to Chicago on February 22, 1927.<br /><br />Mount Greenwood is home to many Chicago firefighters, police officers and union workers of Irish heritage.", "MORGAN PARK": "Morgan Park, located on the far south side of the city of Chicago, Illinois, United States, is one of the city's 77 semi-official community areas.", "OHARE": "O'Hare, located on the far northwest side of Chicago, Illinois, is one of the city's 77 official community areas. O'Hare International Airport is located within the boundaries of this community area. This community area is the only one that extends outside Cook County; the western edge (an area comprising the southwest part of the airport) is in DuPage County.<br /><br />The area is a transportation hub containing O'Hare International Airport as well as major roads such as Interstate 90, its auxiliary Interstate 190, Interstate 294, Illinois Route 72, Illinois Route 171, U.S. Route 12 and U.S. Route 45. This allows the O'Hare neighborhood, combined with the nearby suburb of Rosemont, to work as an edge city.", "EDGEWATER": "Edgewater is a lakefront community area on the North Side of the city of Chicago, Illinois seven miles north of the Loop. As one of Chicago's 77 official community areas, Edgewater is bounded by Foster Avenue on the south, Devon Avenue on the north, Ravenswood Avenue on the west, and Lake Michigan on the east. Edgewater contains several beaches that residents enjoy in the late spring, summer, and early autumn. Chicago's largest park, Lincoln Park, stretches south from Edgewater for seven miles along the waterfront, almost to downtown. Historically, Edgewater was the northeastern corner of Lake View Township, an independent suburb which was annexed by the city of Chicago in 1889. Today, the Uptown community is to Edgewater's south, Lincoln Square to its west, West Ridge to its northwest and Rogers Park to its north.<br /><br />Edgewater was first developed around the 1880s as a summer home for Chicago's elite. Today, it provides the northern terminus of both Lincoln Park and Lake Shore Drive. With the exception of pockets acknowledged as historic districts (like the Bryn Mawr Historic District), east-Edgewater (Edgewater Beach) boasts a skyline of high-rise apartment buildings, condominium complexes, and mid-rise homes. To the west, Edgewater is characterized by commercial businesses; single-family homes; and two-, three-, or four-story flats, including the historic neighborhood of Andersonville.", "EDISON PARK": "Edison Park (formerly Canfield) is one of the 77 community areas of Chicago, in North Side, Chicago, Illinois.<br /><br />It consists entirely of the Edison Park neighborhood, and is named after Thomas Alva Edison. T. Edison gave his blessing to this community namesake in 1890. According to the 2000 Census, its population is 11,259. Edison Park has one of the highest concentrations of Irish ancestry in Chicago, where they make up over three-fourths of the neighborhood's population.<br /><br />Located between the Des Plaines River and the Chicago River this area served as a local continental divide, with the Chicago River flowing then into Lake Michigan, which connected to the Atlantic Ocean through the Great Lakes, and the Des Plaines River feeding into the Illinois River and the Mississippi River to reach the Gulf of Mexico. Edison Park served as one of the portage points for early travelers who would carry their canoes across it to the north branch of the Chicago River corridor and is conveniently located next to Portage Park, Chicago, more generally recognized for this type of access.<br /><br />Edison Park's settlement history dates back to 1834, with the arrival of pioneer Christian Ebinger Sr., 21, and his family: parents John and Katherine Ebinger along with his new bride, Barbara. As they traveled northwest from Chicago on the Indian trail to Milwaukee, Wisconsin (Milwaukee Avenue), their single horse was bitten by a snake and died, leaving them stranded. Consequently, the Ebingers decided to settle between Touhy and Devon. Their settlement location was west of the North Branch of the Chicago River, where they were joined by Christian's older brothers Frederick and John along with their sister Elizabeth (Mrs. John) Plank. The local public elementary school was named after Christian Ebinger. Edison Park incorporated as a village in 1881 and was annexed to Chicago on November 8, 1910.<br /><br />One tradition in the community since 1972 is the Edison Park Festival, an end-of-summer weekend sponsored by the Edison Park Chamber of Commerce, combining merchant sidewalk sales, entertainment, a parade, Taste of Chicago and arts and crafts. It is an opportunity to introduce visitors to the benefits and beauty of the Edison Park community. The EP Fest is celebrated every year in mid-August.<br /><br /><br /><br />Edison Park has the lowest violent crime rate of any Chicago neighborhood. Ranked as one of the best neighborhoods in Chicago, Edison Park also boasts a variety of restaurants and bars."}